RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
/*============================================================================
**
**                     CONFIDENTIAL VISTEON CORPORATION
**
** This is an unpublished work of authorship, which contains trade secrets,
** created in 2013. Visteon Corporation owns all rights to this work and
** intends to maintain it in confidence to preserve its trade secret status.
** Visteon Corporation reserves the right, under the copyright laws of the
** United States or those of any other country that may have jurisdiction,
** to protect this work as an unpublished work, in the event of an
** inadvertent or deliberate unauthorized publication. Visteon Corporation
** also reserves its rights under all copyright laws to protect this work as
** a published work, when appropriate. Those having access to this work may
** not copy it, use it, modify it or disclose the information contained in
** it without the written authorization of Visteon Corporation.
**
**============================================================================
**
** Name:           hmi_gfx_mgr02_imxrt_pxp.c
**
** Description:    Building Graphics element using IMXRT PXP driver API
**
** Organization:   GUI Software Section, Visteon
**
**============================================================================
**
**==========================================================================*/

#define HMI_GFX_MGR02_IMXRT_PXP_C
#define HMI_GFX_MGR02_PRIV_C

/*============================================================================
** I N C L U D E   F I L E S
**==========================================================================*/
#include "hmi_gfx_mgr02_layout.h"
#if defined(GFX_MGR02_IMXRT_PXP)

#include "hmi_gfx_mgr02_imxrt.h"
#include "hmi_gfx_mgr02_context.h"
#ifdef GFX02_DEBUG_INFO
#include "fsl_debug_console.h"
#endif
#include "hmi_gfx_mgr02_imxrt_pxp.h"
#include "hmi_gfx_mgr02_text.h"
#include "hmi_gfx_mgr02_clut_table.h"
#include "hmi_gfx_mgr02_cache.h"

#if defined(GFX_MGR02_COMPRESSION_ENABLED)
#include "hmi_gfx_mgr02_sw_compression.h"
#endif

#ifdef  __cplusplus
extern "C" {
#endif

//#define USE_IMXRT_PXP_QUEUE

#define GFX_MGR02_IMXRT_FLUSH_PENDING     (0x01U)
#define GFX_MGR02_IMXRT_FB_UPDATED        (0x02U)

#define GFX_MGR02_IMXRT_NO_FLUSH_PENDING     (0xFEU)

  /*============================================================================
  ** I N T E R N A L   M A C R O   A N D   T Y P E   D E F I N I T I O N S
  **==========================================================================*/
#define PXP_ID PXP

#define GM2_IMXRT_R(argb)  ((UINT8)(((argb) >> 16UL) & (UINT32)0xFF))
#define GM2_IMXRT_G(argb)  ((UINT8)(((argb) >>  8UL) & (UINT32)0xFF))
#define GM2_IMXRT_B(argb)  ((UINT8)(argb))
#define GM2_IMXRT_A(argb)  ((UINT8)((argb)>> 24UL))

#define MAX_NO_OF_PXP_COMMAND_BUFFER      2

/*============================================================================
** I N T E R N A L   F U N C T I O N   P R O T O T Y P E S
**==========================================================================*/


static void hmi_gfx_mgr02_imxrt_pxp_blt(void);
static void hmi_gfx_mgr02_imxrt_pxp_get_character_buf(UINT8 * p_char_alphadata,
                                                      UINT32 * p_char_argb_data,
                                                      UINT32 p_fg_color,
                                                      UINT32 p_char_width,
                                                      UINT32 p_char_height);
static pxp_ps_pixel_format_t hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format(u_gx_flocal p_pix_format);
static UINT32 hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp(pxp_ps_pixel_format_t p_format);
static UINT32 hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(pxp_as_pixel_format_t p_format);
#if defined(GFX_PERFORMANCE_MEASUREMENT)
extern UINT32 hmi_gfx_mgr02_imxrt_pxp_get_time_in_msec(UINT32 fl_end_time, UINT32 fl_start_time);
extern UINT32 hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count(void);
#endif
#if !defined(GFX_MGR02_IMXRT)	
static UINT8 hmi_gfx_mgr02_is_emergency_shutdown_req_active(void);
#endif
static pxp_as_pixel_format_t hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(u_gx_flocal p_pix_format);
static void draw_windows_bmp_string(SINT16 x, GFX_MGR02_CONTEXT_T  const *p_cntx_SP,
                                    HMI_CHAR const * p_string_p,
                                    GFX_MGR02_FONT const * p_font_SP, UINT32 p_fg_color, UINT32 p_str_length);

/*=============================================================================
** M E M O R Y   A L L O C A T I O N
**==========================================================================*/

typedef struct _pxp_command
{
  UINT32 CTRL;
  UINT32 STAT;
  UINT32 OUT_CTRL;
  UINT32 OUT_BUF;
  UINT32 OUT_BUF2;
  UINT32 OUT_PITCH;
  UINT32 OUT_LRC;
  UINT32 OUT_PS_ULC;
  UINT32 OUT_PS_LRC;
  UINT32 OUT_AS_ULC;
  UINT32 OUT_AS_LRC;
  UINT32 PS_CTRL;
  UINT32 PS_BUF;
  UINT32 PS_UBUF;
  UINT32 PS_VBUF;
  UINT32 PS_PITCH;
  UINT32 PS_BACHGROUND;
  UINT32 PS_SCALE;
  UINT32 PS_OFFSET;
  UINT32 PS_CLRKEYLOW;
  UINT32 PS_CLRKEYHIGH;
  UINT32 AS_CTRL;
  UINT32 AS_BUF;
  UINT32 AS_PITCH;
  UINT32 AS_CLRKEYLOW;
  UINT32 AS_CLRKEYHIGH;
  UINT32 CSC1_COEF0;
  UINT32 CSC1_COEF1;
  UINT32 CSC1_COEF2;
#if !(defined(FSL_FEATURE_PXP_HAS_NO_CSC2) && FSL_FEATURE_PXP_HAS_NO_CSC2)
  UINT32 CSC2_CTRL;
  UINT32 CSC2_COEF0;
  UINT32 CSC2_COEF1;
  UINT32 CSC2_COEF2;
  UINT32 CSC2_COEF3;
  UINT32 CSC2_COEF4;
  UINT32 CSC2_COEF5;
#else
  UINT32 CSC2_RESERVE[7];
#endif
#if !(defined(FSL_FEATURE_PXP_HAS_NO_LUT) && FSL_FEATURE_PXP_HAS_NO_LUT)
  UINT32 LUT_CTRL;
  UINT32 LUT_ADDR;
  UINT32 LUT_DATA;
  UINT32 LUT_EXTMEM;
  UINT32 CFA;
#else
  UINT32 LUT_RESERVE[5];
#endif
  UINT32 HIST_CTRL;
  UINT32 HIST2_PARAM;
  UINT32 HIST4_PARAM;
  UINT32 HIST8_PARAM0;
  UINT32 HIST8_PARAM1;
  UINT32 HIST16_PARAM0;
  UINT32 HIST16_PARAM1;
  UINT32 HIST16_PARAM2;
  UINT32 HIST16_PARAM3;
  UINT32 POWER;
  UINT32 NEXT;
} pxp_command_t;

static  UINT8   l_imxrt_draw_sts;
static  volatile UINT8          l_gfx_mgr_shutdown_status;

static UINT32 l_char_argb_buf[2][GFX_MGRO02_FONT_CHARBUF_MAX_SIZE];

#ifdef USE_IMXRT_PXP_QUEUE
static pxp_command_t l_pxp_command_buffer[MAX_NO_OF_PXP_COMMAND_BUFFER];
static UINT8 l_pxp_command_buffer_index = 0;
#endif
/*============================================================================
** E N T R Y   P O I N T S  /  D A T A   A C C E S S   S E R V I C E S
**==========================================================================*/

/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_init
Description          : Initializes the library internal variables
Invocation           : 
Parameters           : None
Return Value         : True if init success
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_init(void)
{
  l_imxrt_draw_sts = (UINT8)0;
#ifdef USE_IMXRT_PXP_QUEUE
  l_pxp_command_buffer_index = 0;
#endif
#if !defined(GFX_MGR02_IMXRT)
  l_gfx_mgr_shutdown_status = GFX_MGR02_SHUTDOWN_NORMAL;
#endif
  PXP_Init(PXP_ID);
  PXP_EnableCsc1(PXP_ID, false);     /* Disable CSC1, it is enabled by default. */
  PXP_SetProcessBlockSize(PXP_ID, kPXP_BlockSize16); /* Block size 16x16 for higher performance */
  return((s_gx_flocal)TRUE);
}
#if !defined(GFX_MGR02_IMXRT)
/*============================================================================
** Function Name:    hmi_gfx_mgr02_is_emergency_shutdown_req_active
** Visibility:       Global
** Description:      Sets the shutdown mode type.
** Invocation:       By 
** Inputs/Outputs:   None
** Critical Section: None.
** Created:          05-Sep-2014
** Updated:          05-Sep-2014
**==========================================================================*/
static UINT8 hmi_gfx_mgr02_is_emergency_shutdown_req_active(void)
{
  return (l_gfx_mgr_shutdown_status);
}
#endif

/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_start
Description          : Initializes the library internal variables
Invocation           : 
Parameters           : GFX_MGR02_CONTEXT_T
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_start(GFX_MGR02_CONTEXT_T const * p_cntx_SP)
{

