RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
  UINT8 fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();

  if(GFX_MGR02_SHUTDOWN_EMERGENCY != fl_shutdown_state)
  {
    l_imxrt_draw_sts = (UINT8)0;
  }
  GFX_MGR02_UNUSED_PTR(p_cntx_SP);
  return(TRUE);
}
#ifdef USE_IMXRT_PXP_QUEUE
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_active_pxp_buffer
Description          :
Invocation           :
Parameters           :
Return Value         :
Critical Section     : None
External Interfaces  : None
******************************************************************************/
pxp_command_t * hmi_gfx_mgr02_imxrt_pxp_get_active_pxp_buffer(void)
{
  return &l_pxp_command_buffer[l_pxp_command_buffer_index];
}
#endif
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_blt
Description          : 
Invocation           : 
Parameters           : 
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
static void hmi_gfx_mgr02_imxrt_pxp_blt(void)
{
  #ifdef USE_IMXRT_PXP_QUEUE
  pxp_command_t * fl_pxp_comm_buff = hmi_gfx_mgr02_imxrt_pxp_get_active_pxp_buffer();
  while (PXP_IsNextCommandPending(PXP_ID))
  {
  }
  PXP_ClearStatusFlags(PXP_ID, kPXP_CompleteFlag);
  PXP_SetNextCommand(PXP_ID, fl_pxp_comm_buff);
  l_pxp_command_buffer_index++;
  if(l_pxp_command_buffer_index == MAX_NO_OF_PXP_COMMAND_BUFFER)
  {
     l_pxp_command_buffer_index = 0;
  }
  l_imxrt_draw_sts = (GFX_MGR02_IMXRT_FLUSH_PENDING|GFX_MGR02_IMXRT_FB_UPDATED);
  #else
  PXP_Start(PXP_ID);
  /* Wait for process complete. */
  while (!(kPXP_CompleteFlag & PXP_GetStatusFlags(PXP_ID)))
  {

  }
  PXP_ClearStatusFlags(PXP_ID, kPXP_CompleteFlag);
  l_imxrt_draw_sts = (GFX_MGR02_IMXRT_FLUSH_PENDING|GFX_MGR02_IMXRT_FB_UPDATED);
  #endif
}



#ifdef USE_IMXRT_PXP_QUEUE
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_build_image
Description          : Build the image object of the merge widget.
Invocation           : Invoked by hmi_gfx_mgr02_generic_build_image().
Parameters           : GFX_MGR02_CONTEXT_T , GFX_MGR02_IMAGE_DEF_T
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_build_image(GFX_MGR02_CONTEXT_T  const *p_cntx_SP , GFX_MGR02_IMAGE_DEF_T  const *p_elem_def_SP)
{
  UINT32   fl_fg_color;
  UINT32   fl_alpha_temp;
  UINT32   fl_rle_words;
#if defined(GFX_PERFORMANCE_MEASUREMENT)
  UINT32 fl_start_time;
  UINT32 fl_end_time;
  UINT32 fl_time_in_msec;
#endif

  void *   vImgAddr;
  UINT8    fl_rgba[4];
  UINT8    fl_shutdown_state;
  UINT16   fl_clip_w;
  UINT16   fl_clip_h;
  UINT32 fl_out_bpp_size;
  UINT32 fl_ps_bpp_size;
  UINT32 fl_as_bpp_size;
  UINT32 fl_out_fb_format;
  UINT32 fl_as_fb_format;
  UINT32 fl_ps_fb_format;
  pxp_porter_duff_config_t pdConfig;
  s_gx_flocal fl_return_value=(s_gx_flocal)FALSE;
  void *   fl_dest_ptr;

  vImgAddr  = (void*)p_elem_def_SP->pixel_data;

#if defined(GFX_PERFORMANCE_MEASUREMENT)
  fl_start_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
#endif
  /*
  ** 1. Create the surface object for the image and assign the image data to the surface.
  ** 2. Assign the CLUT if any.
  ** 3. Bind the surface to the passed pixel engine context
  */
  fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();
  if((p_cntx_SP->state.invisible == (UINT8)0) && (GFX_MGR02_SHUTDOWN_EMERGENCY != fl_shutdown_state)
    && (p_cntx_SP->state.clip.ex > p_cntx_SP->state.clip.sx)&&(p_cntx_SP->state.clip.ey > p_cntx_SP->state.clip.sy))
  {
      if(p_elem_def_SP->format == kPXP_PsPixelFormatYVU420)
      {
          fl_ps_fb_format =  p_elem_def_SP->format;
          fl_ps_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp(p_elem_def_SP->format);
          fl_as_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(p_cntx_SP->rprop.fb_format);
          fl_as_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(fl_as_fb_format);

      }
      else
      {
          fl_ps_fb_format =  hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format(p_cntx_SP->rprop.fb_format);
          fl_ps_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp(fl_ps_fb_format);
          /* AS buffer - source image */
          fl_as_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(p_elem_def_SP->format);


      }
      fl_out_fb_format =  hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
      fl_out_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);

      fl_dest_ptr = (UINT32)p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * (UINT32)p_cntx_SP->state.clip.sy * (fl_out_bpp_size/8)) + ((UINT32)p_cntx_SP->state.clip.sx* (fl_out_bpp_size/8));
      vImgAddr  = (UINT32)vImgAddr + ((UINT32)p_elem_def_SP->width * (UINT32)(p_cntx_SP->state.clip.sy - p_cntx_SP->state.loc.y) * (fl_as_bpp_size/8)) + ((UINT32)(p_cntx_SP->state.clip.sx - p_cntx_SP->state.loc.x)* (fl_as_bpp_size/8));

      pxp_command_t * fl_pxp_comm_buff = hmi_gfx_mgr02_imxrt_pxp_get_active_pxp_buffer();


      fl_clip_w = p_cntx_SP->state.clip.ex - p_cntx_SP->state.clip.sx;
      fl_clip_h = p_cntx_SP->state.clip.ey-p_cntx_SP->state.clip.sy;
      fl_pxp_comm_buff->CTRL       = PXP_CTRL_ROT_POS(0) | PXP_CTRL_ENABLE_MASK| PXP_CTRL_NEXT_IRQ_ENABLE_MASK|PXP_CTRL_IRQ_ENABLE_MASK |PXP_CTRL_BLOCK_SIZE(kPXP_BlockSize16);
      fl_pxp_comm_buff->STAT       = 0x00000000;                              /* STAT, don't care */
      fl_pxp_comm_buff->OUT_CTRL   = PXP_OUT_CTRL_FORMAT(fl_out_fb_format)|PXP_OUT_CTRL_INTERLACED_OUTPUT(kPXP_OutputProgressive); /* OUT_CTRL */
      if(p_elem_def_SP->format == kPXP_PsPixelFormatYVU420)
      {
        fl_pxp_comm_buff->OUT_BUF    = (UINT32)fl_dest_ptr;                                             /* OUT_BUF */
      }
      else
      {
        fl_pxp_comm_buff->OUT_BUF    = (UINT32)vImgAddr;                                             /* OUT_BUF */
      }
      fl_pxp_comm_buff->OUT_BUF2   = 0x00000000;                                                      /* OUT_BUF2 */
      fl_pxp_comm_buff->OUT_PITCH  = p_cntx_SP->rprop.fb_w * (fl_out_bpp_size/8);                     /* OUT_PITCH */
      fl_pxp_comm_buff->OUT_LRC    = PXP_OUT_LRC_Y(fl_clip_h -1) | PXP_OUT_LRC_X(fl_clip_w -1);       /* OUT_LRC */
      fl_pxp_comm_buff->OUT_PS_ULC = PXP_OUT_PS_ULC_Y(0) | PXP_OUT_PS_ULC_X(0);                       /* OUT_PS_ULC */
      fl_pxp_comm_buff->OUT_PS_LRC = PXP_OUT_PS_LRC_Y(fl_clip_h -1) | PXP_OUT_PS_LRC_X(fl_clip_w -1); /* OUT_PS_LRC */
      /* Disable AS. */
      fl_pxp_comm_buff->OUT_AS_ULC    = PXP_OUT_AS_ULC_Y(0) | PXP_OUT_AS_ULC_X(0);                            /* OUT_AS_ULC */
      fl_pxp_comm_buff->OUT_AS_LRC    = PXP_OUT_AS_LRC_Y(fl_clip_h -1) | PXP_OUT_AS_LRC_X(fl_clip_w -1);      /* OUT_AS_LRC */

