RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
      fl_pxp_comm_buff->PS_CTRL       = PXP_PS_CTRL_FORMAT(fl_ps_fb_format);          /* PS_CTRL */
      fl_pxp_comm_buff->PS_UBUF       = 0x00000000;                                   /* PS_UBUF */
      fl_pxp_comm_buff->PS_VBUF       = 0x00000000;                                   /* PS_VBUF */
      if(p_elem_def_SP->format == kPXP_PsPixelFormatYVU420)
      {
        fl_pxp_comm_buff->PS_PITCH  = p_elem_def_SP->width *(fl_ps_bpp_size/8);               /* OUT_PITCH */
        fl_pxp_comm_buff->PS_BUF    = (UINT32)vImgAddr;                                    /* PS_BUF */        
        fl_pxp_comm_buff->AS_BUF    = fl_dest_ptr;                                         /* AS_BUF */

      }
      else
      {      
        fl_pxp_comm_buff->PS_PITCH      = p_cntx_SP->rprop.fb_w * (fl_out_bpp_size/8);  /* PS_PITCH */
        fl_pxp_comm_buff->PS_BUF        = (UINT32)fl_dest_ptr;                          /* PS_BUF */        
        fl_pxp_comm_buff->AS_BUF        = vImgAddr;                                     /* AS_BUF */
      }  
      fl_pxp_comm_buff->PS_BACHGROUND = 0x00000000;                                   /* PS_BACHGROUND */
      fl_pxp_comm_buff->PS_SCALE      = 0x10001000;                                   /* PS_SCALE */
      fl_pxp_comm_buff->PS_OFFSET     = 0x00000000;                                   /* PS_OFFSET */
      fl_pxp_comm_buff->PS_CLRKEYLOW  = 0x00FFFFFF;                                   /* PS_CLRKEYLOW */
      fl_pxp_comm_buff->PS_CLRKEYHIGH = 0x00000000;                                   /* PS_CLRKEYHIGH */
      fl_pxp_comm_buff->AS_CTRL       = PXP_AS_CTRL_FORMAT(p_elem_def_SP->format)|PXP_AS_CTRL_ROP(kPXP_RopMaskAs)|PXP_AS_CTRL_ALPHA(p_cntx_SP->state.alpha)|PXP_AS_CTRL_ALPHA_CTRL(kPXP_AlphaMultiply); /* AS_CTRL */

      fl_pxp_comm_buff->AS_PITCH      = p_elem_def_SP->width *(fl_as_bpp_size/8);     /* AS_PITCH */
      if(p_elem_def_SP->chroma_key !=0U)
      {			
        fl_pxp_comm_buff->AS_CLRKEYLOW  = p_cntx_SP->rprop.fg_color;                  /* AS_CLRKEYLOW */
        fl_pxp_comm_buff->AS_CLRKEYHIGH = p_cntx_SP->rprop.fg_color;                  /* AS_CLRKEYHIGH */
      }
      else			
      {
        fl_pxp_comm_buff->AS_CLRKEYLOW  = 0x00FFFFFF;                            /* AS_CLRKEYLOW */
        fl_pxp_comm_buff->AS_CLRKEYHIGH = 0x00000000;                            /* AS_CLRKEYHIGH */

      }
      if(p_elem_def_SP->format == kPXP_PsPixelFormatYVU420)
      {

          fl_pxp_comm_buff->CSC1_COEF0 = PXP_CSC1_COEF0_YCBCR_MODE(0x0U) | PXP_CSC1_COEF0_BYPASS(0x1U)
                                                                | PXP_CSC1_COEF0_C0(0x100U)
                                                                | PXP_CSC1_COEF0_Y_OFFSET(0x0U)
                                                                | PXP_CSC1_COEF0_UV_OFFSET(0x0U);

          fl_pxp_comm_buff->CSC1_COEF1 = PXP_CSC1_COEF1_C1(0x0123U)        /* 1.140. */
                                                                | PXP_CSC1_COEF1_C4(0x0208U);     /* 2.032. */
          fl_pxp_comm_buff->CSC1_COEF2 = PXP_CSC1_COEF2_C2(0x076BU)        /* -0.851. */
                                                                | PXP_CSC1_COEF2_C3(0x079BU);     /* -0.394. */
      }
      else
      {
          fl_pxp_comm_buff->CSC1_COEF0    = 0x00000000;            /* CSC1_COEF0, don't care. */
          fl_pxp_comm_buff->CSC1_COEF1    = 0x00000000;                            /* CSC1_COEF1, don't care. */
          fl_pxp_comm_buff->CSC1_COEF2    = 0x00000000;                            /* CSC1_COEF2, don't care. */

      }
#if !(defined(FSL_FEATURE_PXP_HAS_NO_CSC2) && FSL_FEATURE_PXP_HAS_NO_CSC2)
      fl_pxp_comm_buff->CSC2_CTRL  = PXP_CSC2_CTRL_BYPASS_MASK; /* CSC2_CTRL */
      fl_pxp_comm_buff->CSC2_COEF0 = 0x00000000;                /* CSC2_COEF0, don't care. */
      fl_pxp_comm_buff->CSC2_COEF1 = 0x00000000;                /* CSC2_COEF1, don't care. */
      fl_pxp_comm_buff->CSC2_COEF2 = 0x00000000;                /* CSC2_COEF2, don't care. */
      fl_pxp_comm_buff->CSC2_COEF3 = 0x00000000;                /* CSC2_COEF3, don't care. */
      fl_pxp_comm_buff->CSC2_COEF4 = 0x00000000;                /* CSC2_COEF4, don't care. */
      fl_pxp_comm_buff->CSC2_COEF5 = 0x00000000;                /* CSC2_COEF5, don't care. */
#endif
#if !(defined(FSL_FEATURE_PXP_HAS_NO_LUT) && FSL_FEATURE_PXP_HAS_NO_LUT)
      fl_pxp_comm_buff->LUT_CTRL   = PXP_LUT_CTRL_BYPASS_MASK; /* LUT_CTRL */
      fl_pxp_comm_buff->LUT_ADDR   = 0x00000000;               /* LUT_ADDR */
      fl_pxp_comm_buff->LUT_DATA   = 0x00000000;               /* LUT_DATA */
      fl_pxp_comm_buff->LUT_EXTMEM = 0x00000000;               /* LUT_EXTMEM */
      fl_pxp_comm_buff->CFA        = 0x00000000;               /* CFA */
#endif
      fl_pxp_comm_buff->HIST_CTRL     = 0x00000020;            /* HIST_CTRL */
      fl_pxp_comm_buff->HIST2_PARAM   = 0x00000F00;            /* HIST2_PARAM */
      fl_pxp_comm_buff->HIST4_PARAM   = 0x0F0A0500;            /* HIST4_PARAM */
      fl_pxp_comm_buff->HIST8_PARAM0  = 0x06040200;            /* HIST8_PARAM0 */
      fl_pxp_comm_buff->HIST8_PARAM1  = 0x0F0D0B09;            /* HIST8_PARAM1 */
      fl_pxp_comm_buff->HIST16_PARAM0 = 0x03020100;            /* HIST16_PARAM0 */
      fl_pxp_comm_buff->HIST16_PARAM1 = 0x07060504;            /* HIST16_PARAM1 */
      fl_pxp_comm_buff->HIST16_PARAM2 = 0x0B0A0908;            /* HIST16_PARAM2 */
      fl_pxp_comm_buff->HIST16_PARAM3 = 0x0F0E0D0C;            /* HIST16_PARAM3 */
      fl_pxp_comm_buff->POWER         = 0x00000000;            /* POWER */
      fl_pxp_comm_buff->NEXT          = 0x00000000;            /* NEXT, don't care */ 

      /* Output buffer. */
      hmi_gfx_mgr02_imxrt_pxp_blt();
#if defined(GFX_PERFORMANCE_MEASUREMENT)
    fl_end_time     = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
    fl_time_in_msec = hmi_gfx_mgr02_imxrt_pxp_get_time_in_msec(fl_end_time,fl_start_time);
#ifdef GFX_DEBUG_INFO
    PRINTF("\r\n Build image %08X %d \r\n",p_elem_def_SP, fl_time_in_msec);
#endif
#endif
  }
#ifdef GFX02_DEBUG_INFO
  else
  {
    gfx_debug("PXP for Imxrt - Image elem =%08X skipped\n", p_elem_def_SP);
  }
#endif

  fl_return_value = (s_gx_flocal)TRUE;
  return(fl_return_value);

