RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
}
#else
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_build_image
Description          : Build the image object of the merge widget.
Invocation           : Invoked by hmi_gfx_mgr02_generic_build_image().
Parameters           : GFX_MGR02_CONTEXT_T , GFX_MGR02_IMAGE_DEF_T
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_build_image(GFX_MGR02_CONTEXT_T  const* p_cntx_SP, GFX_MGR02_IMAGE_DEF_T  const* p_elem_def_SP)
{
    #if defined(GFX_PERFORMANCE_MEASUREMENT)
    UINT32 fl_start_time;
    UINT32 fl_end_time;
    UINT32 fl_time_in_msec;
    #endif
    UINT8    fl_shutdown_state;
    UINT32   fl_bpp_size;
    void*    fl_dest_ptr;
    UINT32   fl_fg_color;
    void*    vImgAddr = NULL;

    pxp_output_pixel_format_t fl_out_fb_format;
    pxp_as_pixel_format_t     fl_as_fb_format;
    pxp_ps_pixel_format_t     fl_ps_fb_format;
  
    s_gx_flocal fl_return_value = (s_gx_flocal)FALSE;

    if ((pxp_ps_pixel_format_t)p_elem_def_SP->format == kPXP_PsPixelFormatYVU420)
    {
        PXP_EnableCsc1(PXP_ID, true);
        PXP_SetCsc1Mode(PXP_ID, kPXP_Csc1YCbCr2RGB);
    }
    else
    {
        PXP_EnableCsc1(PXP_ID, false);     /* Disable CSC1, it is enabled by default. */
    }
    PXP_SetProcessBlockSize(PXP, kPXP_BlockSize16); /* Block size 16x16 for higher performance */

    #if defined(GFX_PERFORMANCE_MEASUREMENT)
    fl_start_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
    #endif
    
    /*
    ** 1. Create the surface object for the image and assign the image data to the surface.
    ** 2. Assign the CLUT if any.
    ** 3. Bind the surface to the passed pixel engine context
    */
    
    fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();
    if ((p_cntx_SP->state.invisible == (UINT8)0) && (GFX_MGR02_SHUTDOWN_EMERGENCY != fl_shutdown_state)
    #if defined(GFX_MGR02_CLIPPED_WIDGETS)
    && (p_cntx_SP->state.clip.ex > p_cntx_SP->state.clip.sx) && (p_cntx_SP->state.clip.ey > p_cntx_SP->state.clip.sy)
    #endif
    )
    {
        pxp_output_buffer_config_t  outputBufferConfig;
        pxp_as_buffer_config_t      asBufferConfig;
        pxp_porter_duff_config_t    pdConfig;

        UINT16 fl_clip_w;
        UINT16 fl_clip_h;

        GFX_MGR02_VISIBLE_AREA fl_curr_clip;
        GFX_MGR02_VISIBLE_AREA fl_new_clip;

        fl_curr_clip.sx = p_cntx_SP->state.clip.sx;
        fl_curr_clip.sy = p_cntx_SP->state.clip.sy;
        fl_curr_clip.ex = p_cntx_SP->state.clip.ex;
        fl_curr_clip.ey = p_cntx_SP->state.clip.ey;

        fl_new_clip.sx = p_cntx_SP->state.loc.x;
        fl_new_clip.sy = p_cntx_SP->state.loc.y;
        fl_new_clip.ex = fl_new_clip.sx + (SINT16)p_elem_def_SP->width;
        fl_new_clip.ey = fl_new_clip.sy + (SINT16)p_elem_def_SP->height;

        (void)hmi_gfx_mgr02_context_validate_clip(&fl_curr_clip, &fl_new_clip);
        fl_clip_w = fl_curr_clip.ex - fl_curr_clip.sx;
        fl_clip_h = fl_curr_clip.ey - fl_curr_clip.sy;

        #if defined(GFX_MGR02_COMPRESSION_ENABLED)
        if ((p_elem_def_SP->compression == GFX_MGR02_IMAGE_COMPRESSION_SWRLE) && (p_elem_def_SP->comp_size > 0UL))
        {     
            void * fl_frame_buff_ptr = hmi_gfx_mgr02_context_get_sw_decompr_buffer();
            if (fl_frame_buff_ptr != GFX_MGR02_NULL_PTR)
            {
                if ((pxp_as_pixel_format_t)p_elem_def_SP->format == kPXP_AsPixelFormatARGB4444)
                {
                    hmi_gfx_mgr02_comp_decompr_16bpp(p_elem_def_SP, &((UINT16*)fl_frame_buff_ptr)[0]);
                    vImgAddr = fl_frame_buff_ptr;
                }
                else if ((pxp_as_pixel_format_t)p_elem_def_SP->format == kPXP_AsPixelFormatARGB8888)
                {
                    hmi_gfx_mgr02_comp_decompr_32bpp(p_elem_def_SP, &((UINT32*)fl_frame_buff_ptr)[0]);
                    vImgAddr = fl_frame_buff_ptr;
                }
                else
                { 
                    vImgAddr = (void*)p_elem_def_SP->pixel_data;
                }
            }
        }
        else
        #endif
        {
            vImgAddr = (void*)p_elem_def_SP->pixel_data;
        }
        
        if (vImgAddr != NULL)
        {
            if (p_elem_def_SP->format == kPXP_AsPixelFormatIndex8BPP)
            {
                /* Disable PS */
                PXP_SetProcessSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U);
                PXP_SetProcessSurfaceBackGroundColor(PXP_ID, 0);

                fl_as_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(p_elem_def_SP->format);
                fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(fl_as_fb_format);
                asBufferConfig.pixelFormat = fl_as_fb_format;
                asBufferConfig.bufferAddr = (UINT32)vImgAddr;
                asBufferConfig.pitchBytes = p_elem_def_SP->width;

                PXP_SetAlphaSurfaceBufferConfig(PXP_ID, &asBufferConfig);
                PXP_SetAlphaSurfacePosition(PXP_ID, 0, 0, (fl_clip_w / 2U) - 1U, fl_clip_h - 1U);

                fl_dest_ptr = (void*)((UINT32)p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * (UINT32)fl_curr_clip.sy) + ((UINT32)fl_curr_clip.sx));

                /* Output buffer. */
                fl_out_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
                fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);
                outputBufferConfig.pixelFormat = fl_out_fb_format;
                outputBufferConfig.interlacedMode = kPXP_OutputProgressive;
                outputBufferConfig.buffer0Addr = (UINT32)fl_dest_ptr;
                outputBufferConfig.buffer1Addr = (UINT32)0U;
                outputBufferConfig.pitchBytes = p_cntx_SP->rprop.fb_w;
                outputBufferConfig.width = p_elem_def_SP->width / (fl_bpp_size / 8U);
                outputBufferConfig.height = p_elem_def_SP->height;
                PXP_SetOutputBufferConfig(PXP_ID, &outputBufferConfig);

