RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
                /* Configure SRC OVER Porter-Duff blending */
                pdConfig.enable = 1;
                pdConfig.dstFactorMode = kPXP_PorterDuffFactorInversed;
                pdConfig.srcFactorMode = kPXP_PorterDuffFactorOne;
                pdConfig.srcColorMode = kPXP_PorterDuffColorInversed;
                pdConfig.dstColorMode = kPXP_PorterDuffColorStraight;
                pdConfig.srcGlobalAlphaMode = kPXP_PorterDuffScaledAlpha;
                pdConfig.dstGlobalAlphaMode = kPXP_PorterDuffLocalAlpha;
                pdConfig.dstAlphaMode = kPXP_PorterDuffAlphaStraight;
                pdConfig.srcAlphaMode = kPXP_PorterDuffAlphaStraight;
                pdConfig.dstGlobalAlpha = 0U;
                pdConfig.srcGlobalAlpha = p_cntx_SP->state.alpha;
                PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);
    
                hmi_gfx_mgr02_imxrt_pxp_blt();
    
                pdConfig.enable = 0;
                PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);
            }
            else
            {
                if ((pxp_ps_pixel_format_t)p_elem_def_SP->format == kPXP_PsPixelFormatYVU420)
                {
                    void* fl_y_ptr = vImgAddr;
                    void* fl_u_ptr = (void*)((UINT32)vImgAddr + (p_elem_def_SP->height * p_elem_def_SP->width));
                    void* fl_v_ptr = (void*)((UINT32)vImgAddr + (p_elem_def_SP->height * p_elem_def_SP->width) + ((p_elem_def_SP->height * p_elem_def_SP->width) / 4U));

                    /* use process surface for input image or video frame */
                    fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp((pxp_ps_pixel_format_t)p_elem_def_SP->format);
                    pxp_ps_buffer_config_t psBufferConfig = {
                      .pixelFormat = (pxp_ps_pixel_format_t)p_elem_def_SP->format,
                      .swapByte = false,
                      .bufferAddr = ((UINT32)fl_y_ptr + ((UINT32)p_elem_def_SP->width * (UINT32)(fl_curr_clip.sy - p_cntx_SP->state.loc.y) * (fl_bpp_size / 8U)) + ((UINT32)(fl_curr_clip.sx - p_cntx_SP->state.loc.x) * (fl_bpp_size / 8U))),
                      .bufferAddrU = ((UINT32)fl_u_ptr + ((UINT32)p_elem_def_SP->width * (UINT32)(fl_curr_clip.sy - p_cntx_SP->state.loc.y) * (fl_bpp_size / 32U)) + ((UINT32)(fl_curr_clip.sx - p_cntx_SP->state.loc.x) * (fl_bpp_size / 32U))),
                      .bufferAddrV = ((UINT32)fl_v_ptr + ((UINT32)p_elem_def_SP->width * (UINT32)(fl_curr_clip.sy - p_cntx_SP->state.loc.y) * (fl_bpp_size / 32U)) + ((UINT32)(fl_curr_clip.sx - p_cntx_SP->state.loc.x) * (fl_bpp_size / 32U))),
                      .pitchBytes = p_elem_def_SP->width * (fl_bpp_size / 8U),
                    };
                    PXP_SetProcessSurfaceBufferConfig(PXP_ID, &psBufferConfig);

                    /* Disable AS */
                    fl_as_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(p_cntx_SP->rprop.fb_format);
                    fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(fl_as_fb_format);
                    fl_dest_ptr = (void*)((UINT32)p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * (UINT32)fl_curr_clip.sy * (fl_bpp_size / 8U)) + ((UINT32)fl_curr_clip.sx * (fl_bpp_size / 8U)));
                    PXP_SetAlphaSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U);

                    PXP_EnableOverWrittenAlpha(PXP_ID, true);
                    PXP_SetOverwrittenAlphaValue(PXP_ID, 255U);
                }
                else
                {
                    /* use alpha surface for input image */
                    fl_ps_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format(p_cntx_SP->rprop.fb_format);
                    fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp(fl_ps_fb_format);
                    fl_dest_ptr = (void*)((UINT32)p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * (UINT32)fl_curr_clip.sy * (fl_bpp_size / 8U)) + ((UINT32)fl_curr_clip.sx * (fl_bpp_size / 8U)));

                    pxp_ps_buffer_config_t psBufferConfig = {
                      .pixelFormat = fl_ps_fb_format,
                      .swapByte = false,
                      .bufferAddr = (UINT32)fl_dest_ptr,
                      .bufferAddrU = 0U,
                      .bufferAddrV = 0U,
                      .pitchBytes = p_cntx_SP->rprop.fb_w * (fl_bpp_size / 8U),
                    };
                    PXP_SetProcessSurfaceBufferConfig(PXP_ID, &psBufferConfig);

                    /* Alpha blending or color keying enabled - PS must be enabled to fetch background pixels
                    PS and OUT buffers are the same, blend will be done in-place */

                    /* AS buffer for source image */

                    fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp((pxp_as_pixel_format_t)p_elem_def_SP->format);
                    asBufferConfig.pixelFormat = (pxp_as_pixel_format_t)p_elem_def_SP->format;
                    asBufferConfig.bufferAddr = (UINT32)vImgAddr + ((UINT32)p_elem_def_SP->width * (UINT32)(fl_curr_clip.sy - p_cntx_SP->state.loc.y) * (fl_bpp_size / 8U)) + ((UINT32)(fl_curr_clip.sx - p_cntx_SP->state.loc.x) * (fl_bpp_size / 8U));
                    asBufferConfig.pitchBytes = p_elem_def_SP->width * (fl_bpp_size / 8U);

                    PXP_SetAlphaSurfaceBufferConfig(PXP_ID, &asBufferConfig);
                    PXP_SetAlphaSurfacePosition(PXP_ID, 0, 0, (fl_clip_w - 1U), (fl_clip_h - 1U));

                    /* Configure SRC OVER Porter-Duff blending */
                    (void)memset(&pdConfig, 0, sizeof(pxp_porter_duff_config_t));
                    pdConfig.enable = 1;
                    pdConfig.dstFactorMode = kPXP_PorterDuffFactorInversed;
                    pdConfig.srcFactorMode = kPXP_PorterDuffFactorOne;
                    pdConfig.srcColorMode = kPXP_PorterDuffColorInversed;
                    pdConfig.dstColorMode = kPXP_PorterDuffColorStraight;
                    pdConfig.srcGlobalAlphaMode = kPXP_PorterDuffScaledAlpha;
                    pdConfig.dstGlobalAlphaMode = kPXP_PorterDuffLocalAlpha;
                    pdConfig.dstAlphaMode = kPXP_PorterDuffAlphaStraight;
                    pdConfig.srcAlphaMode = kPXP_PorterDuffAlphaStraight;
                    pdConfig.dstGlobalAlpha = 0U;
                    pdConfig.srcGlobalAlpha = p_cntx_SP->state.alpha;
                    PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);
                }

