RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
                PXP_SetProcessSurfaceBackGroundColor(PXP_ID, 0U);
                PXP_SetProcessSurfacePosition(PXP_ID, 0, 0, (fl_clip_w - 1U), (fl_clip_h - 1U));

                fl_fg_color = p_cntx_SP->rprop.fg_color;
                if (p_elem_def_SP->chroma_key != 0U)
                {
                    PXP_SetAlphaSurfaceOverlayColorKey(PXP_ID, fl_fg_color, fl_fg_color);
                }
                PXP_EnableAlphaSurfaceOverlayColorKey(PXP_ID, p_elem_def_SP->chroma_key);

                /* Output buffer. */
                fl_out_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
                fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);
                outputBufferConfig.pixelFormat = fl_out_fb_format;
                outputBufferConfig.interlacedMode = kPXP_OutputProgressive;
                outputBufferConfig.buffer0Addr = (UINT32)fl_dest_ptr;
                outputBufferConfig.buffer1Addr = (UINT32)0U;
                outputBufferConfig.pitchBytes = p_cntx_SP->rprop.fb_w * (fl_bpp_size / 8U);
                outputBufferConfig.width = fl_clip_w;
                outputBufferConfig.height = fl_clip_h;
                PXP_SetOutputBufferConfig(PXP_ID, &outputBufferConfig);

                hmi_gfx_mgr02_imxrt_pxp_blt();

                if ((pxp_ps_pixel_format_t)p_elem_def_SP->format == kPXP_PsPixelFormatYVU420)
                {
                    PXP_EnableOverWrittenAlpha(PXP_ID, false);
                }
                else
                {
                    pdConfig.enable = 0;
                    PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);
                }
                #if defined(GFX_PERFORMANCE_MEASUREMENT)
                fl_end_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
                fl_time_in_msec = hmi_gfx_mgr02_imxrt_pxp_get_time_in_msec(fl_end_time, fl_start_time);
                #ifdef GFX_DEBUG_INFO
                PRINTF("\r\n Build image %08X %d \r\n", p_elem_def_SP, fl_time_in_msec);
                #endif
                #endif
            }
        }
    }
    #ifdef GFX02_DEBUG_INFO
    else
    {
        gfx_debug("PXP for Imxrt - Image elem =%08X skipped\n", p_elem_def_SP);
    }
    #endif
    fl_return_value = (s_gx_flocal)TRUE;
    return(fl_return_value);
}
#endif

#ifdef USE_IMXRT_PXP_QUEUE
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_buf_copy
Description          : Build the image object of the merge widget.
Invocation           : Invoked by hmi_gfx_mgr02_generic_build_image().
Parameters           : GFX_MGR02_CONTEXT_T , GFX_MGR02_IMAGE_DEF_T
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_mem_copy(UINT32  *p_src_ptr , UINT32  *p_dest_ptr, UINT32 p_size)
{
#if defined(GFX_PERFORMANCE_MEASUREMENT)
  UINT32 fl_start_time;
  UINT32 fl_stop_time;
  UINT32 fl_time_in_msec;
#endif
  UINT32 fl_out_bpp_size;
  UINT32 fl_ps_fb_format;
  UINT32 fl_as_fb_format;
  UINT32 fl_out_fb_format;
  status_t fl_pxp_st;
  s_gx_flocal fl_return_value = (s_gx_flocal)TRUE;
#if defined(GFX_PERFORMANCE_MEASUREMENT)
  fl_start_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
#endif
  GFX_MGR02_CONTEXT_T const * fl_context_ptr = hmi_gfx_mgr02_context_get_ptr();
  fl_out_fb_format =  hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(fl_context_ptr->rprop.fb_format);
  fl_ps_fb_format =  hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format(fl_context_ptr->rprop.fb_format);

  fl_out_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);
  //fl_pxp_st = PXP_StartMemCopy(PXP_ID, p_src_ptr, p_dest_ptr, p_size);

  pxp_command_t * fl_pxp_comm_buff = hmi_gfx_mgr02_imxrt_pxp_get_active_pxp_buffer();

  fl_pxp_comm_buff->CTRL       = PXP_CTRL_ROT_POS(0) | PXP_CTRL_ENABLE_MASK | PXP_CTRL_NEXT_IRQ_ENABLE_MASK |PXP_CTRL_IRQ_ENABLE_MASK| PXP_CTRL_BLOCK_SIZE(kPXP_BlockSize16);
  fl_pxp_comm_buff->STAT       = 0x00000000;                              /* STAT, don't care */
  fl_pxp_comm_buff->OUT_CTRL   = PXP_OUT_CTRL_FORMAT(fl_out_fb_format)|PXP_OUT_CTRL_INTERLACED_OUTPUT(kPXP_OutputProgressive); /* OUT_CTRL */
  fl_pxp_comm_buff->OUT_BUF    = (UINT32)p_dest_ptr;                /* OUT_BUF */
  fl_pxp_comm_buff->OUT_BUF2   = 0x00000000;                              /* OUT_BUF2 */
  fl_pxp_comm_buff->OUT_PITCH  = fl_context_ptr->rprop.fb_w * (fl_out_bpp_size/8);                 /* OUT_PITCH */
  fl_pxp_comm_buff->OUT_LRC    = PXP_OUT_LRC_Y(fl_context_ptr->rprop.fb_h - 1U) | PXP_OUT_LRC_X(fl_context_ptr->rprop.fb_w - 1U); /* OUT_LRC */
  fl_pxp_comm_buff->OUT_PS_ULC = PXP_OUT_PS_ULC_Y(0x3FFFu) | PXP_OUT_PS_ULC_X(0x3FFFu);        /* OUT_PS_ULC */
  fl_pxp_comm_buff->OUT_PS_LRC = PXP_OUT_PS_LRC_Y(0) | PXP_OUT_PS_LRC_X(0);        /* OUT_PS_LRC */
  /* Disable AS. */
  fl_pxp_comm_buff->OUT_AS_ULC    = PXP_OUT_AS_ULC_Y(0) | PXP_OUT_AS_ULC_X(0);                            /* OUT_AS_ULC */
  fl_pxp_comm_buff->OUT_AS_LRC    = PXP_OUT_AS_LRC_Y(fl_context_ptr->rprop.fb_h - 1U) | PXP_OUT_AS_LRC_X(fl_context_ptr->rprop.fb_w - 1U);                            /* OUT_AS_LRC */

  fl_pxp_comm_buff->PS_CTRL       = 0x00000000;                            /* PS_CTRL */
  fl_pxp_comm_buff->PS_BUF        = (UINT32)0;                             /* PS_BUF */
  fl_pxp_comm_buff->PS_UBUF       = 0x00000000;                            /* PS_UBUF */
  fl_pxp_comm_buff->PS_VBUF       = 0x00000000;                            /* PS_VBUF */
  fl_pxp_comm_buff->PS_PITCH      = 0x00000000;                            /* PS_PITCH */
  fl_pxp_comm_buff->PS_BACHGROUND = 0x00000000;                            /* PS_BACHGROUND */
  fl_pxp_comm_buff->PS_SCALE      = 0x10001000;                            /* PS_SCALE */
  fl_pxp_comm_buff->PS_OFFSET     = 0x00000000;                            /* PS_OFFSET */
  fl_pxp_comm_buff->PS_CLRKEYLOW  = 0x00FFFFFF;                            /* PS_CLRKEYLOW */
  fl_pxp_comm_buff->PS_CLRKEYHIGH = 0x00000000;                            /* PS_CLRKEYHIGH */
  fl_pxp_comm_buff->AS_CTRL       = PXP_AS_CTRL_FORMAT(fl_out_fb_format)|PXP_AS_CTRL_ROP(kPXP_RopMergeAs)|PXP_AS_CTRL_ALPHA(255)|PXP_AS_CTRL_ALPHA_CTRL(kPXP_AlphaRop);                            /* AS_CTRL */
  fl_pxp_comm_buff->AS_BUF        = p_src_ptr;                            /* AS_BUF */
  fl_pxp_comm_buff->AS_PITCH      = fl_context_ptr->rprop.fb_w *(fl_out_bpp_size/8);                            /* AS_PITCH */
  fl_pxp_comm_buff->AS_CLRKEYLOW  = 0x00FFFFFF;                            /* AS_CLRKEYLOW */
  fl_pxp_comm_buff->AS_CLRKEYHIGH = 0x00000000;                            /* AS_CLRKEYHIGH */

