RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
  fl_pxp_comm_buff->CSC1_COEF0    = 0x00000000;                            /* CSC1_COEF0, don't care. */
  fl_pxp_comm_buff->CSC1_COEF1    = 0x00000000;                            /* CSC1_COEF1, don't care. */
  fl_pxp_comm_buff->CSC1_COEF2    = 0x00000000;                            /* CSC1_COEF2, don't care. */
#if !(defined(FSL_FEATURE_PXP_HAS_NO_CSC2) && FSL_FEATURE_PXP_HAS_NO_CSC2)
  fl_pxp_comm_buff->CSC2_CTRL  = PXP_CSC2_CTRL_BYPASS_MASK; /* CSC2_CTRL */
  fl_pxp_comm_buff->CSC2_COEF0 = 0x00000000;                /* CSC2_COEF0, don't care. */
  fl_pxp_comm_buff->CSC2_COEF1 = 0x00000000;                /* CSC2_COEF1, don't care. */
  fl_pxp_comm_buff->CSC2_COEF2 = 0x00000000;                /* CSC2_COEF2, don't care. */
  fl_pxp_comm_buff->CSC2_COEF3 = 0x00000000;                /* CSC2_COEF3, don't care. */
  fl_pxp_comm_buff->CSC2_COEF4 = 0x00000000;                /* CSC2_COEF4, don't care. */
  fl_pxp_comm_buff->CSC2_COEF5 = 0x00000000;                /* CSC2_COEF5, don't care. */
#endif
#if !(defined(FSL_FEATURE_PXP_HAS_NO_LUT) && FSL_FEATURE_PXP_HAS_NO_LUT)
  fl_pxp_comm_buff->LUT_CTRL   = PXP_LUT_CTRL_BYPASS_MASK; /* LUT_CTRL */
  fl_pxp_comm_buff->LUT_ADDR   = 0x00000000;               /* LUT_ADDR */
  fl_pxp_comm_buff->LUT_DATA   = 0x00000000;               /* LUT_DATA */
  fl_pxp_comm_buff->LUT_EXTMEM = 0x00000000;               /* LUT_EXTMEM */
  fl_pxp_comm_buff->CFA        = 0x00000000;               /* CFA */
#endif
  fl_pxp_comm_buff->HIST_CTRL     = 0x00000020; /* HIST_CTRL */
  fl_pxp_comm_buff->HIST2_PARAM   = 0x00000F00; /* HIST2_PARAM */
  fl_pxp_comm_buff->HIST4_PARAM   = 0x0F0A0500; /* HIST4_PARAM */
  fl_pxp_comm_buff->HIST8_PARAM0  = 0x06040200; /* HIST8_PARAM0 */
  fl_pxp_comm_buff->HIST8_PARAM1  = 0x0F0D0B09; /* HIST8_PARAM1 */
  fl_pxp_comm_buff->HIST16_PARAM0 = 0x03020100; /* HIST16_PARAM0 */
  fl_pxp_comm_buff->HIST16_PARAM1 = 0x07060504; /* HIST16_PARAM1 */
  fl_pxp_comm_buff->HIST16_PARAM2 = 0x0B0A0908; /* HIST16_PARAM2 */
  fl_pxp_comm_buff->HIST16_PARAM3 = 0x0F0E0D0C; /* HIST16_PARAM3 */
  fl_pxp_comm_buff->POWER         = 0x00000000; /* POWER */
  fl_pxp_comm_buff->NEXT          = 0x00000000; /* NEXT, don't care */

  hmi_gfx_mgr02_imxrt_pxp_blt();



#if defined(GFX_PERFORMANCE_MEASUREMENT)
  fl_stop_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
  fl_time_in_msec = COUNT_TO_MSEC(fl_stop_time - fl_start_time , SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
#ifdef GFX_DEBUG_INFO
  PRINTF("\rMemcpy msec %d\r\n",fl_time_in_msec );
#endif
#endif
  return(fl_return_value);
}
#else
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_mem_copy(UINT32  *p_src_ptr , UINT32  *p_dest_ptr, UINT32 p_size)
{
#if defined(GFX_PERFORMANCE_MEASUREMENT)
  UINT32 fl_start_time;
  UINT32 fl_stop_time;
  UINT32 fl_time_in_msec;
#endif
  status_t fl_pxp_st;
  s_gx_flocal fl_return_value = (s_gx_flocal)FALSE;
#if defined(GFX_PERFORMANCE_MEASUREMENT)
  fl_start_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
#endif
  if((p_size != 0U) && (p_src_ptr != NULL) && (p_dest_ptr != NULL))
  {
    if((p_size % 512U) == 0U)
    {
      fl_pxp_st = PXP_StartMemCopy(PXP_ID, (UINT32)p_src_ptr, (UINT32)p_dest_ptr, p_size);
    }
    else
    {
      pxp_as_pixel_format_t fl_as_fb_format;
      UINT32 fl_as_bpp_size;
      pxp_pic_copy_config_t fl_mem_copy_config;
      GFX_MGR02_CONTEXT_T const * fl_context_ptr = hmi_gfx_mgr02_context_get_ptr();
      fl_as_fb_format =  hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(fl_context_ptr->rprop.fb_format);
      fl_as_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(fl_as_fb_format);
      fl_mem_copy_config.srcPicBaseAddr = (UINT32)p_src_ptr;
      fl_mem_copy_config.srcPitchBytes = fl_context_ptr->rprop.fb_w * (fl_as_bpp_size/8U);
      fl_mem_copy_config.srcOffsetX = 0;
      fl_mem_copy_config.srcOffsetY = 0;
      fl_mem_copy_config.destPicBaseAddr = (UINT32)p_dest_ptr;
      fl_mem_copy_config.destPitchBytes =  fl_context_ptr->rprop.fb_w * (fl_as_bpp_size/8);
      fl_mem_copy_config.destOffsetX = 0;
      fl_mem_copy_config.destOffsetY = 0;
      fl_mem_copy_config.width = fl_context_ptr->rprop.fb_w;
      fl_mem_copy_config.height = fl_context_ptr->rprop.fb_h;
      fl_mem_copy_config.pixelFormat = fl_as_fb_format;
      fl_pxp_st = PXP_StartPictureCopy(PXP_ID, &fl_mem_copy_config);
    }
    if(fl_pxp_st == kStatus_Success)
    {
      fl_return_value = (s_gx_flocal)TRUE;
    }
    while (!(kPXP_CompleteFlag & PXP_GetStatusFlags(PXP_ID)))
    {

    }
    PXP_ClearStatusFlags(PXP_ID, kPXP_CompleteFlag);
#if defined(GFX_PERFORMANCE_MEASUREMENT)
    fl_stop_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
    fl_time_in_msec = COUNT_TO_MSEC(fl_stop_time - fl_start_time , SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
#ifdef GFX_DEBUG_INFO
    PRINTF("\rMemcpy msec %d\r\n",fl_time_in_msec );
#endif
#endif
  }
  return(fl_return_value);
}
#endif

#ifdef USE_IMXRT_PXP_QUEUE
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_build_fill
Description          : Builds the fill object of the merge widget.
Invocation           : 
Parameters           : None
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_build_fill(GFX_MGR02_CONTEXT_T   const *p_cntx_SP , GFX_MGR02_FILL_DEF_T   const *p_elem_def_SP, GFX_MGR02_IDIM_DATA const *p_dim)
{
  UINT32 fl_fg_color;
  UINT32 fl_alpha_temp;
  UINT8  fl_rgba[4];
  UINT32 fl_fb_format;
#if defined(GFX_PERFORMANCE_MEASUREMENT)
  UINT32 fl_start_time;
  UINT32 fl_end_time;
  UINT32 fl_time_in_msec;
#endif

  UINT16   fl_clip_w;
  UINT16   fl_clip_h;

  void *   fl_dest_ptr;

  UINT8 fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();

  s_gx_flocal fl_return_value = (s_gx_flocal)FALSE;

  if((p_cntx_SP->state.invisible == (UINT8)0) && (GFX_MGR02_SHUTDOWN_EMERGENCY != fl_shutdown_state)
    && (p_cntx_SP->state.clip.ex > p_cntx_SP->state.clip.sx)&&(p_cntx_SP->state.clip.ey > p_cntx_SP->state.clip.sy))
  {
#if defined(GFX_PERFORMANCE_MEASUREMENT)
    fl_start_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
#endif
    /* OUT buffer configure */
    fl_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
    UINT32 fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_fb_format);

    fl_clip_w = p_cntx_SP->state.clip.ex - p_cntx_SP->state.clip.sx;
    fl_clip_h = p_cntx_SP->state.clip.ey - p_cntx_SP->state.clip.sy;
    fl_dest_ptr = (UINT32)(p_cntx_SP->rprop.fb_P + (UINT32)p_cntx_SP->rprop.fb_w * (UINT32)p_cntx_SP->state.clip.sy * (fl_bpp_size/8) + ((UINT32)p_cntx_SP->state.clip.sx * (fl_bpp_size/8)));

      pxp_command_t * fl_pxp_comm_buff = hmi_gfx_mgr02_imxrt_pxp_get_active_pxp_buffer();
      fl_pxp_comm_buff->CTRL       = PXP_CTRL_ROT_POS(0) | PXP_CTRL_ENABLE_MASK|PXP_CTRL_NEXT_IRQ_ENABLE_MASK| PXP_CTRL_IRQ_ENABLE_MASK | PXP_CTRL_BLOCK_SIZE(kPXP_BlockSize16);
      fl_pxp_comm_buff->STAT       = 0x00000000;                              /* STAT, don't care */
      fl_pxp_comm_buff->OUT_CTRL   = PXP_OUT_CTRL_FORMAT(fl_fb_format)|PXP_OUT_CTRL_INTERLACED_OUTPUT(kPXP_OutputProgressive); /* OUT_CTRL */
      fl_pxp_comm_buff->OUT_BUF    = (UINT32)fl_dest_ptr;                /* OUT_BUF */
      fl_pxp_comm_buff->OUT_BUF2   = 0x00000000;                              /* OUT_BUF2 */
      fl_pxp_comm_buff->OUT_PITCH  = p_cntx_SP->rprop.fb_w * (fl_bpp_size/8);                 /* OUT_PITCH */
      fl_pxp_comm_buff->OUT_LRC    = PXP_OUT_LRC_Y(fl_clip_h) | PXP_OUT_LRC_X(fl_clip_w); /* OUT_LRC */
      fl_pxp_comm_buff->OUT_PS_ULC = PXP_OUT_PS_ULC_Y(0xFFFFU) | PXP_OUT_PS_ULC_X(0xFFFFU);        /* OUT_PS_ULC */
      fl_pxp_comm_buff->OUT_PS_LRC = PXP_OUT_PS_LRC_Y(0) | PXP_OUT_PS_LRC_X(0);        /* OUT_PS_LRC */
      /* Disable AS. */

