RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
      fl_pxp_comm_buff->OUT_AS_ULC    = PXP_OUT_AS_ULC_Y(0xFFFFU) | PXP_OUT_AS_ULC_X(0xFFFFU);                            /* OUT_AS_ULC */
      fl_pxp_comm_buff->OUT_AS_LRC    = PXP_OUT_AS_LRC_Y(0) | PXP_OUT_AS_LRC_X(0);                            /* OUT_AS_LRC */
      fl_pxp_comm_buff->PS_CTRL       = 0x00000000; /* PS_CTRL */
      fl_pxp_comm_buff->PS_BUF        = 0x00000000;               /* PS_BUF */
      fl_pxp_comm_buff->PS_UBUF       = 0x00000000;                            /* PS_UBUF */
      fl_pxp_comm_buff->PS_VBUF       = 0x00000000;                            /* PS_VBUF */
      fl_pxp_comm_buff->PS_PITCH      = 0x00000000; /* PS_PITCH */
      fl_pxp_comm_buff->PS_BACHGROUND = p_cntx_SP->rprop.fg_color;              /* PS_BACHGROUND */
      fl_pxp_comm_buff->PS_SCALE      = 0x10001000;                            /* PS_SCALE */
      fl_pxp_comm_buff->PS_OFFSET     = 0x00000000;                            /* PS_OFFSET */
      fl_pxp_comm_buff->PS_CLRKEYLOW  = 0x00FFFFFF;                            /* PS_CLRKEYLOW */
      fl_pxp_comm_buff->PS_CLRKEYHIGH = 0x00000000;                            /* PS_CLRKEYHIGH */
      fl_pxp_comm_buff->AS_CTRL       = 0x00000000;
      fl_pxp_comm_buff->AS_BUF        = 0x00000000;                            /* AS_BUF */
      fl_pxp_comm_buff->AS_PITCH      = 0x00000000;                            /* AS_PITCH */
      fl_pxp_comm_buff->AS_CLRKEYLOW  = 0x00FFFFFF;                            /* AS_CLRKEYLOW */
      fl_pxp_comm_buff->AS_CLRKEYHIGH = 0x00000000;                            /* AS_CLRKEYHIGH */
      fl_pxp_comm_buff->CSC1_COEF0    = 0x00000000;                            /* CSC1_COEF0, don't care. */
      fl_pxp_comm_buff->CSC1_COEF1    = 0x00000000;                            /* CSC1_COEF1, don't care. */
      fl_pxp_comm_buff->CSC1_COEF2    = 0x00000000;                            /* CSC1_COEF2, don't care. */
#if !(defined(FSL_FEATURE_PXP_HAS_NO_CSC2) && FSL_FEATURE_PXP_HAS_NO_CSC2)
      fl_pxp_comm_buff->CSC2_CTRL  = PXP_CSC2_CTRL_BYPASS_MASK; /* CSC2_CTRL */
      fl_pxp_comm_buff->CSC2_COEF0 = 0x00000000;                /* CSC2_COEF0, don't care. */
      fl_pxp_comm_buff->CSC2_COEF1 = 0x00000000;                /* CSC2_COEF1, don't care. */
      fl_pxp_comm_buff->CSC2_COEF2 = 0x00000000;                /* CSC2_COEF2, don't care. */
      fl_pxp_comm_buff->CSC2_COEF3 = 0x00000000;                /* CSC2_COEF3, don't care. */
      fl_pxp_comm_buff->CSC2_COEF4 = 0x00000000;                /* CSC2_COEF4, don't care. */
      fl_pxp_comm_buff->CSC2_COEF5 = 0x00000000;                /* CSC2_COEF5, don't care. */
#endif
#if !(defined(FSL_FEATURE_PXP_HAS_NO_LUT) && FSL_FEATURE_PXP_HAS_NO_LUT)
      fl_pxp_comm_buff->LUT_CTRL   = PXP_LUT_CTRL_BYPASS_MASK; /* LUT_CTRL */
      fl_pxp_comm_buff->LUT_ADDR   = 0x00000000;               /* LUT_ADDR */
      fl_pxp_comm_buff->LUT_DATA   = 0x00000000;               /* LUT_DATA */
      fl_pxp_comm_buff->LUT_EXTMEM = 0x00000000;               /* LUT_EXTMEM */
      fl_pxp_comm_buff->CFA        = 0x00000000;               /* CFA */
#endif
      fl_pxp_comm_buff->HIST_CTRL     = 0x00000020; /* HIST_CTRL */
      fl_pxp_comm_buff->HIST2_PARAM   = 0x00000F00; /* HIST2_PARAM */
      fl_pxp_comm_buff->HIST4_PARAM   = 0x0F0A0500; /* HIST4_PARAM */
      fl_pxp_comm_buff->HIST8_PARAM0  = 0x06040200; /* HIST8_PARAM0 */
      fl_pxp_comm_buff->HIST8_PARAM1  = 0x0F0D0B09; /* HIST8_PARAM1 */
      fl_pxp_comm_buff->HIST16_PARAM0 = 0x03020100; /* HIST16_PARAM0 */
      fl_pxp_comm_buff->HIST16_PARAM1 = 0x07060504; /* HIST16_PARAM1 */
      fl_pxp_comm_buff->HIST16_PARAM2 = 0x0B0A0908; /* HIST16_PARAM2 */
      fl_pxp_comm_buff->HIST16_PARAM3 = 0x0F0E0D0C; /* HIST16_PARAM3 */
      fl_pxp_comm_buff->POWER         = 0x00000000; /* POWER */
      fl_pxp_comm_buff->NEXT          = 0x00000000; /* NEXT, don't care */

      hmi_gfx_mgr02_imxrt_pxp_blt();

#if defined(GFX_PERFORMANCE_MEASUREMENT)
      fl_end_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
      fl_time_in_msec = hmi_gfx_mgr02_imxrt_pxp_get_time_in_msec(fl_end_time,fl_start_time);
#ifdef GFX_DEBUG_INFO
      PRINTF("\r\n Build fill %d \r\n",fl_time_in_msec);
#endif
#endif
  }
#ifdef GFX02_DEBUG_INFO
  else
  {
    gfx_debug("PXP for IMXRT - Fill elem =%08X skipped\n", p_elem_def_SP);
  }
#endif
  fl_return_value = (s_gx_flocal)TRUE;
  return(fl_return_value);
}
#else
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_build_fill
Description          : Builds the fill object of the merge widget.
Invocation           : 
Parameters           : None
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_build_fill(GFX_MGR02_CONTEXT_T   const *p_cntx_SP , GFX_MGR02_FILL_DEF_T   const *p_elem_def_SP, GFX_MGR02_IDIM_DATA const *p_dim)
{
  UINT32 fl_fg_color;
  UINT32 fl_alpha_temp;
  UINT8  fl_fillcolor_alpha;
#if defined(GFX_PERFORMANCE_MEASUREMENT)
  UINT32 fl_start_time;
  UINT32 fl_end_time;
  UINT32 fl_time_in_msec;
#endif

  void *   fl_dest_ptr;
  UINT8 fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();
  s_gx_flocal fl_return_value = (s_gx_flocal)FALSE;

  if((p_cntx_SP->state.invisible == (UINT8)0) && (GFX_MGR02_SHUTDOWN_EMERGENCY != fl_shutdown_state)
#if defined(GFX_MGR02_CLIPPED_WIDGETS)
    && (p_cntx_SP->state.clip.ex > p_cntx_SP->state.clip.sx)&&(p_cntx_SP->state.clip.ey > p_cntx_SP->state.clip.sy)
#endif
    )
    {
        pxp_output_pixel_format_t fl_out_fb_format;
        PXP_EnableCsc1(PXP_ID, false);     /* Disable CSC1, it is enabled by default. */
        PXP_SetProcessBlockSize(PXP, kPXP_BlockSize16); /* Block size 16x16 for higher performance */
        
    #if defined (GFX_PERFORMANCE_MEASUREMENT)
        fl_start_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
    #endif
        /* OUT buffer configure */
        fl_out_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
        UINT32 fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);
        
        UINT16 fl_clip_w;
        UINT16 fl_clip_h;
        
        GFX_MGR02_VISIBLE_AREA fl_curr_clip;
        GFX_MGR02_VISIBLE_AREA fl_new_clip;
        
        fl_curr_clip.sx = p_cntx_SP->state.clip.sx;
        fl_curr_clip.sy = p_cntx_SP->state.clip.sy;
        fl_curr_clip.ex = p_cntx_SP->state.clip.ex;
        fl_curr_clip.ey = p_cntx_SP->state.clip.ey;

        fl_new_clip.sx = p_cntx_SP->state.loc.x;
        fl_new_clip.sy = p_cntx_SP->state.loc.y;
        fl_new_clip.ex = fl_new_clip.sx + (SINT16)p_elem_def_SP->dim.width;
        fl_new_clip.ey = fl_new_clip.sy + (SINT16)p_elem_def_SP->dim.height;
        
        (void)hmi_gfx_mgr02_context_validate_clip(&fl_curr_clip, &fl_new_clip);
        fl_clip_w = fl_curr_clip.ex - fl_curr_clip.sx;
        fl_clip_h = fl_curr_clip.ey - fl_curr_clip.sy;
        fl_dest_ptr = (void *)((UINT32)(p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * ((UINT32)fl_curr_clip.sy * (fl_bpp_size / 8U))) + ((UINT32)fl_curr_clip.sx * (fl_bpp_size / 8U))));
        pxp_output_buffer_config_t outputConfig = {
            .pixelFormat    = fl_out_fb_format,
            .interlacedMode = kPXP_OutputProgressive,
            .buffer0Addr    = (UINT32)fl_dest_ptr,
            .buffer1Addr    = (UINT32)NULL,
            .pitchBytes     = p_cntx_SP->rprop.fb_w * (fl_bpp_size/8U),
            .width          = (UINT32)fl_clip_w,
            .height         = (UINT32)fl_clip_h,
        };	  
        PXP_SetOutputBufferConfig(PXP_ID, &outputConfig);

        fl_fg_color = p_cntx_SP->rprop.fg_color;
        fl_fillcolor_alpha = GM2_IMXRT_A(fl_fg_color);

        if((fl_fillcolor_alpha!=(UINT8)0) && ((p_cntx_SP->state.alpha<(UINT8)255) || (fl_fillcolor_alpha<(UINT8)255)))
        {
            /* Fill with opacity - AS used as source (same as OUT), PS used as color generator, blended together */
            pxp_as_buffer_config_t asBufferConfig;
            pxp_porter_duff_config_t pdConfig;
            pxp_as_pixel_format_t fl_as_fb_format;

            fl_alpha_temp = (UINT32)p_cntx_SP->state.alpha * fl_fillcolor_alpha;
            fl_fillcolor_alpha = (UINT8)(fl_alpha_temp/(UINT32)255);
            fl_as_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(p_cntx_SP->rprop.fb_format); 		
            /* Set AS to OUT */
            asBufferConfig.pixelFormat = fl_as_fb_format;
            asBufferConfig.bufferAddr  = (UINT32)outputConfig.buffer0Addr;
            asBufferConfig.pitchBytes  = outputConfig.pitchBytes;

