RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
            PXP_SetAlphaSurfacePosition(PXP_ID, 0, 0, fl_clip_w-1U, fl_clip_h-1U );
            PXP_SetAlphaSurfaceBufferConfig(PXP_ID, &asBufferConfig);
            PXP_EnableAlphaSurfaceOverlayColorKey(PXP_ID, 0);

            /* Disable PS, use as color generator */
            PXP_SetProcessSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U);
            PXP_SetProcessSurfaceBackGroundColor(PXP_ID, fl_fg_color);

            /* Configure DST OVER Porter-Duff blending */
            (void)memset(&pdConfig, 0, sizeof(pxp_porter_duff_config_t));
            pdConfig.enable             = 1;
            pdConfig.srcFactorMode      = kPXP_PorterDuffFactorInversed;
            pdConfig.dstFactorMode      = kPXP_PorterDuffFactorOne;
            pdConfig.dstColorMode       = kPXP_PorterDuffColorInversed;
            pdConfig.srcColorMode       = kPXP_PorterDuffColorStraight;
            pdConfig.dstGlobalAlphaMode = kPXP_PorterDuffGlobalAlpha;
            pdConfig.srcGlobalAlphaMode = kPXP_PorterDuffLocalAlpha;
            pdConfig.srcAlphaMode       = kPXP_PorterDuffAlphaStraight; 
            pdConfig.dstAlphaMode       = kPXP_PorterDuffAlphaStraight; 
            pdConfig.srcGlobalAlpha     = 0U;
            pdConfig.dstGlobalAlpha     = fl_fillcolor_alpha;
            PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);   
            
            hmi_gfx_mgr02_imxrt_pxp_blt();
                
            pdConfig.enable             = 0;
            PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);
        }
        else
        {
            /* Simple color fill without opacity - AS disabled, PS as color generator */
            PXP_SetAlphaSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U); /* Disable AS. */
            PXP_SetProcessSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U); /* Disable PS. */
            PXP_SetProcessSurfaceBackGroundColor(PXP_ID, fl_fg_color);		    
            
            PXP_EnableOverWrittenAlpha(PXP_ID, true);
            PXP_SetOverwrittenAlphaValue(PXP_ID, fl_fillcolor_alpha);
            hmi_gfx_mgr02_imxrt_pxp_blt();
            PXP_EnableOverWrittenAlpha(PXP_ID, false);
        }

    #if defined(GFX_PERFORMANCE_MEASUREMENT)
        fl_end_time = hmi_gfx_mgr02_imxrt_pxp_get_cpu_cycle_count();
        fl_time_in_msec = hmi_gfx_mgr02_imxrt_pxp_get_time_in_msec(fl_end_time,fl_start_time);
    #ifdef GFX_DEBUG_INFO
        PRINTF("\r\n Build fill %d \r\n",fl_time_in_msec);
    #endif
    #endif
    }
#ifdef GFX02_DEBUG_INFO
    else
    {
        gfx_debug("PXP for IMXRT - Fill elem =%08X skipped\n", p_elem_def_SP);
    }
#else
    GFX_MGR02_UNUSED_PTR(p_elem_def_SP);	 
#endif
    GFX_MGR02_UNUSED_PTR(p_dim);
    fl_return_value = (s_gx_flocal)TRUE;
    return(fl_return_value);
}
#endif
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_bound
Description          : Calculates the transformed bounds of an elements passed
boundary
Invocation           : 
Parameters           : Object, Context and boundary
Return Value         : Boundary
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_get_bound(UINT32 p_obj_type, GFX_MGR02_CONTEXT_T const * p_cntx_SP, GFX_FLOAT * p_bounds)
{
  p_bounds[0] = (GFX_FLOAT)p_cntx_SP->state.loc.x;
  p_bounds[1] = (GFX_FLOAT)p_cntx_SP->state.loc.y;
  /* return True by default since no error condition has been identified */
  GFX_MGR02_UNUSED_VAR(p_obj_type);
  return((s_gx_flocal)TRUE);
}


/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format
Description          : This function will provide the output buffer pixel format
                       of imxrt pxp engine.
Invocation           : 
Parameters           : u_gx_flocal
Return Value         : pxp_output_pixel_format_t
Critical Section     : None
External Interfaces  : None
******************************************************************************/
pxp_output_pixel_format_t hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(u_gx_flocal p_pix_format)
{
  pxp_output_pixel_format_t fl_gdc_pix_format;

  switch (p_pix_format)
  {

  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_RGB565:
    fl_gdc_pix_format = kPXP_OutputPixelFormatRGB565;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_RGB888:
    /* Since PS support only 32 bit, here also 32 considered for RGB888. ie., Alpha always 255 */
    fl_gdc_pix_format = kPXP_OutputPixelFormatRGB888;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_ARGB1555:
    fl_gdc_pix_format = kPXP_OutputPixelFormatARGB1555;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_ARGB4444:
    fl_gdc_pix_format = kPXP_OutputPixelFormatARGB4444;
    break;
  case GFX_MGR02_PIX_FORMAT_8BPP:
    fl_gdc_pix_format = kPXP_OutputPixelFormatRGB565;
    break;
  case GFX_MGR02_PIX_FORMAT_4BPP:
    fl_gdc_pix_format = kPXP_OutputPixelFormatRGB565;
    break;
  case GFX_MGR02_PIX_FORMAT_2BPP:
    fl_gdc_pix_format = kPXP_OutputPixelFormatRGB565;
    break;
  default:
    fl_gdc_pix_format = kPXP_OutputPixelFormatARGB8888;
    break;
  }
  return(fl_gdc_pix_format);
}
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format
Description          : This function will provide process buffer pixel format
                       of imxrt pxp engine.
Invocation           : 
Parameters           : u_gx_flocal
Return Value         : pxp_ps_pixel_format_t
Critical Section     : None
External Interfaces  : None
******************************************************************************/
static pxp_ps_pixel_format_t hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format(u_gx_flocal p_pix_format)
{
  pxp_ps_pixel_format_t fl_gdc_pix_format;

  switch (p_pix_format)
  {

  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_RGB565:
    fl_gdc_pix_format = kPXP_PsPixelFormatRGB565;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_RGB888:
    //fl_gdc_pix_format = kPXP_OutputPixelFormatRGB888P;
    fl_gdc_pix_format = kPXP_PsPixelFormatRGB888;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_ARGB4444:
    fl_gdc_pix_format = kPXP_PsPixelFormatRGB444;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_ARGB1555:
      fl_gdc_pix_format = kPXP_PsPixelFormatRGB555;
      break;

  default:
    fl_gdc_pix_format = kPXP_PsPixelFormatRGB888;
    break;
  }
  return(fl_gdc_pix_format);

