RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
}

/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format
Description          : This function will provide process buffer pixel format
                       of imxrt pxp engine.
Invocation           :
Parameters           : u_gx_flocal
Return Value         : pxp_ps_pixel_format_t
Critical Section     : None
External Interfaces  : None
******************************************************************************/
static pxp_as_pixel_format_t hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(u_gx_flocal p_pix_format)
{
  pxp_as_pixel_format_t fl_gdc_pix_format;

  switch (p_pix_format)
  {
   
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_ARGB4444:
    fl_gdc_pix_format = kPXP_AsPixelFormatARGB4444;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_ARGB1555:
    fl_gdc_pix_format = kPXP_AsPixelFormatARGB1555;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_ARGB8888:
    fl_gdc_pix_format = kPXP_AsPixelFormatARGB8888;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_RGB565:
    fl_gdc_pix_format = kPXP_AsPixelFormatRGB565;
    break;
  case (u_gx_flocal)GFX_MGR02_PIX_FORMAT_RGB888:
    fl_gdc_pix_format = kPXP_AsPixelFormatRGB888;
    break;
  case (u_gx_flocal)kPXP_AsPixelFormatIndex8BPP:
    fl_gdc_pix_format = kPXP_AsPixelFormatRGB565;
    break;
  case (u_gx_flocal)kPXP_AsPixelFormatIndex4BPP:
    fl_gdc_pix_format = kPXP_AsPixelFormatRGB565;
    break;
  case (u_gx_flocal)kPXP_AsPixelFormatIndex2BPP:
    fl_gdc_pix_format = kPXP_AsPixelFormatRGB565;
    break;
  default:
    fl_gdc_pix_format = kPXP_AsPixelFormatARGB8888;
    break;
  }
  return(fl_gdc_pix_format);

}

/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_build_text
Description          : Builds the text object . 
Invocation           : Invoked by hmi_gfx_mgr02_generic_build_text()
Parameters           : GFX_MGR02_CONTEXT_T, GFX_MGR02_TEXT_DEF_T, HMI_CHAR, u_gx_flocal
Return Value         : s_gx_flocal
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_build_text(GFX_MGR02_CONTEXT_T   const *p_cntx_SP ,
                                           GFX_MGR02_TEXT_DEF_T   const *p_elem_def_SP, 
                                           HMI_CHAR const *p_string, 
                                           u_gx_flocal p_text_actual_width
#if (defined(GFX_MGR02_IMXRT)||defined(GFX_MGR02_IMXRT_PXP)) && (GFX_MGR02_NUM_OF_MULTI_LINE_TEXTS >  0)
                                           ,u_gx_flocal p_is_multi_line_text
#endif
                                           )
{
#if defined(GFX_MGR02_CLIP_TEXT_ENABLE)
  static HMI_CHAR l_irislib_clip_text_str[GFX_MGR02_MAX_TEXT_LENGTH+1];
#endif

  GFX_MGR02_FONT const * fl_font_SP;
  HMI_CHAR       const * fl_string_ptr = NULL;
  HMI_CHAR       const * fl_print_str  = NULL;
  UINT32   fl_str_length = 0UL;
  UINT16   fl_text_width;
  GFX_UINT fl_alignment  = p_cntx_SP->rprop.alignment;
  UINT32   fl_font_id;
#ifdef GFX_STRING_CACHE_ENABLED
  /*Below variable is used only for allocating memory for full string when string cache is enabled.*/
  UINT16 fl_full_text_width = 0U;
#endif
  SINT16 fl_glyph_draw_x;

#ifndef GFX_STRING_CACHE_ENABLED
  UINT8  fl_use_ttf_engine = (UINT8)0;
#endif
    
  s_gx_flocal fl_return_value = (s_gx_flocal)FALSE;
  UINT8 fl_shutdown_state     = hmi_gfx_mgr02_is_emergency_shutdown_req_active();
  if((p_cntx_SP->state.invisible == (UINT8)0) && (GFX_MGR02_SHUTDOWN_EMERGENCY != fl_shutdown_state)
#if defined(GFX_MGR02_CLIPPED_WIDGETS)
    && (p_cntx_SP->state.clip.ex > p_cntx_SP->state.clip.sx)&&(p_cntx_SP->state.clip.ey > p_cntx_SP->state.clip.sy)
#endif
    )
  {
    fl_font_id = hmi_gfx_mgr02_get_font_id((UINT32)p_cntx_SP->rprop.font_id);
    fl_font_SP = hmi_gfx_mgr02_get_font_pointer(fl_font_id);
    if(fl_font_SP != GFX_MGR02_NULL_PTR)
    {
      GFX_MGR02_TEXT_INFO fl_text_info_S;
      fl_text_info_S.print_str_P         = p_string;
      fl_text_info_S.max_available_width = p_cntx_SP->rprop.text_width;
      #if (defined(GFX_MGR02_USE_EXT_FONT_ENGINE))
      fl_text_info_S.font_pt_size = p_cntx_SP->rprop.font_size.point_size;
      #endif

#if defined(GFX_MGR02_CLIP_TEXT_ENABLE)
#if (GFX_MGR02_NUM_OF_MULTI_LINE_TEXTS > 0)
      if(p_is_multi_line_text != FALSE)
      {
        fl_text_info_S.append_str = FALSE;
      }
      else
#endif
      {
        fl_text_info_S.append_str = TRUE;
      }
      l_irislib_clip_text_str[0] = 0;
#else
      fl_text_info_S.append_str = FALSE;
#endif
      fl_text_info_S.num_chars_to_process = p_elem_def_SP->num_chars;
      fl_text_info_S.dyn_text_def_SP      = p_elem_def_SP;
#ifdef GFX_MGR_APPEND_BASEDON_APP_IP
      fl_text_info_S.get_dynamic_clipinfo = (UINT8)TRUE;
#endif
      (void)hmi_gfx_mgr02_get_text_width(&fl_text_info_S,
        (UINT32)p_cntx_SP->rprop.font_id,
        (UINT32)p_cntx_SP->rprop.clip_mode,
        (UINT32)p_cntx_SP->rprop.alignment
#if defined(GFX_MGR02_CLIP_TEXT_ENABLE)
        ,l_irislib_clip_text_str
#endif
        );

#if (defined(GFX_MGR02_CLIP_TEXT_ENABLE))
      fl_print_str  = l_irislib_clip_text_str;
#else
      fl_print_str  = fl_text_info_S.print_str_P;
#endif
      fl_string_ptr = fl_print_str;
      fl_text_width = fl_text_info_S.print_width;
      fl_str_length = fl_text_info_S.print_length_U8;
#ifdef GFX_STRING_CACHE_ENABLED
      fl_full_text_width = fl_text_info_S.print_width;
#endif
    }
    else
    {
      fl_text_width = (UINT16)0;
    }
    if(fl_text_width > (UINT16)0)
    {
      UINT32 fl_fg_color;
      UINT32 fl_bg_color;
      SINT32 fl_start_x;
      UINT32 fl_alpha_temp;
      SINT32 fl_txtbox_strt_x;
      UINT8  fl_bgfill_color_alpha;
      UINT8  fl_draw_mode;

#ifdef GFX_STRING_CACHE_ENABLED
      UINT8 * fl_str_img_data;
#endif

      if(fl_text_width > p_cntx_SP->rprop.text_width)
      {
        fl_text_width = p_cntx_SP->rprop.text_width;
      }
      if (fl_alignment == GFX_MGR02_TP_ALIGN_RIGHT)
      {
        fl_txtbox_strt_x = (SINT32)p_cntx_SP->rprop.text_width;
        if(p_elem_def_SP->alignment == GFX_MGR02_TP_ALIGN_RIGHT)
        {
          fl_start_x     = ((SINT32)fl_text_width - 1);
        }
        else
        {
          fl_start_x     = (SINT32)(fl_text_width);
        }
      }
      else if (fl_alignment == GFX_MGR02_TP_ALIGN_CENTRE)
      {
        fl_start_x       = ((SINT32)fl_text_width /2);
        fl_txtbox_strt_x = ((SINT32)p_cntx_SP->rprop.text_width / 2);
      }
      else
      {
        fl_start_x       = 0;
        fl_txtbox_strt_x = 0;
      }
#if (GFX_MGR02_NUM_TEXT_ANIM_ELEMENTS > 0) || (GFX_MGR02_NUM_OF_FONT_GROUPS > 0)
      if (fl_alignment == GFX_MGR02_TP_ALIGN_CENTRE)
      {
        /* 
        ** handle case where the current alignment is different than default alignment 
        */
        if(p_elem_def_SP->alignment == GFX_MGR02_TP_ALIGN_LEFT)
        {
          fl_start_x       -= ((SINT32)p_cntx_SP->rprop.text_width / 2);
          fl_txtbox_strt_x -= ((SINT32)p_cntx_SP->rprop.text_width/2);
          
