RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
        }
        else if(p_elem_def_SP->alignment == GFX_MGR02_TP_ALIGN_RIGHT)
        { 
          fl_txtbox_strt_x += ((SINT32)p_cntx_SP->rprop.text_width/2);
          fl_txtbox_strt_x -=1;
          fl_start_x       += ((SINT32)p_cntx_SP->rprop.text_width / 2);
          /* Tool generates (p_cntx_SP->state.loc.x = TextWidth + startx -1) for right aligned text. */
          /* So it needs to be considered here */
          fl_start_x       -= 1;
        }
        else
        {
          /*To Fix MISRA warning*/
        }
      }
      else if (fl_alignment == GFX_MGR02_TP_ALIGN_RIGHT)
      {
        if(p_elem_def_SP->alignment == GFX_MGR02_TP_ALIGN_LEFT)
        {
          fl_start_x       -= (SINT32)(p_cntx_SP->rprop.text_width);
          fl_txtbox_strt_x = 0;
        }
        else if(p_elem_def_SP->alignment == GFX_MGR02_TP_ALIGN_CENTRE)
        {
          fl_start_x       -= ((SINT32)p_cntx_SP->rprop.text_width/2);
          fl_txtbox_strt_x -= ((SINT32)p_cntx_SP->rprop.text_width/2);
        }
        else
        {
          fl_txtbox_strt_x -=1;
        }
      }
      else
      {
        if(p_elem_def_SP->alignment == GFX_MGR02_TP_ALIGN_CENTRE)
        {
          fl_start_x       += ((SINT32)p_cntx_SP->rprop.text_width/2);
          fl_txtbox_strt_x = ((SINT32)p_cntx_SP->rprop.text_width/2);
        }
        else if(p_elem_def_SP->alignment == GFX_MGR02_TP_ALIGN_RIGHT)
        {
          fl_txtbox_strt_x += ((SINT32)p_cntx_SP->rprop.text_width -(SINT32)1);
          fl_start_x       += (SINT32)p_cntx_SP->rprop.text_width;
          /*  Tool generates (p_cntx_SP->state.loc.x = TextWidth + startx -1) for right aligned text.So it needs to be considered here  */
          fl_start_x       -= 1; 
        }
        else
        {
          /*To fix MISRA warning.*/
        }
      }
#endif

      fl_start_x   = ((SINT32)p_cntx_SP->state.loc.x - fl_start_x);
      fl_txtbox_strt_x = ((SINT32)p_cntx_SP->state.loc.x - fl_txtbox_strt_x);
      fl_draw_mode = (UINT8)p_cntx_SP->rprop.draw_mode;
      fl_fg_color  = p_cntx_SP->rprop.fg_color;

      if (fl_draw_mode != GFX_MGR02_TP_DRAW_TRANSP)
      {
        pxp_output_pixel_format_t  fl_out_fb_format;
        UINT16   fl_clip_w;
        UINT16   fl_clip_h;
        UINT32   fl_bpp_size;
        void *   fl_dest_ptr;
        
        GFX_MGR02_VISIBLE_AREA fl_curr_clip;
        GFX_MGR02_VISIBLE_AREA fl_new_clip;

        PXP_EnableCsc1(PXP_ID, false);     /* Disable CSC1, it is enabled by default. */
        PXP_SetProcessBlockSize(PXP, kPXP_BlockSize16); /* Block size 16x16 for higher performance */

        fl_out_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
        fl_bpp_size      = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);
                
        fl_curr_clip.sx = p_cntx_SP->state.clip.sx;
        fl_curr_clip.sy = p_cntx_SP->state.clip.sy;
        fl_curr_clip.ex = p_cntx_SP->state.clip.ex;
        fl_curr_clip.ey = p_cntx_SP->state.clip.ey;

        fl_new_clip.sx = (SINT16)fl_txtbox_strt_x;
        fl_new_clip.sy = p_cntx_SP->state.loc.y;
        fl_new_clip.ex = fl_new_clip.sx + (SINT16)p_cntx_SP->rprop.text_width;
        fl_new_clip.ey = fl_new_clip.sy + (SINT16)fl_font_SP->p.height;

        (void)hmi_gfx_mgr02_context_validate_clip(&fl_curr_clip, &fl_new_clip);
        fl_clip_w = fl_curr_clip.ex - fl_curr_clip.sx;
        fl_clip_h = fl_curr_clip.ey - fl_curr_clip.sy;
        
        fl_dest_ptr = (void *)((UINT32)(p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * (UINT32)fl_curr_clip.sy * (fl_bpp_size / 8U)) + ((UINT32)fl_curr_clip.sx * (fl_bpp_size / 8U))));

        pxp_output_buffer_config_t outputConfig = {

          .pixelFormat    = fl_out_fb_format,
          .interlacedMode = kPXP_OutputProgressive,
          .buffer0Addr    = (UINT32)fl_dest_ptr,
          .buffer1Addr    = (UINT32)NULL,
          .pitchBytes     = p_cntx_SP->rprop.fb_w * (fl_bpp_size/8U),
          .width          = (UINT32)fl_clip_w,
          .height         = (UINT32)fl_clip_h,

        };
        PXP_SetOutputBufferConfig(PXP_ID, &outputConfig);

        if (fl_draw_mode == GFX_MGR02_TP_DRAW_REVERSE)
        {
          fl_bg_color = p_cntx_SP->rprop.fg_color;
          fl_fg_color = p_cntx_SP->rprop.bg_color;
        }
        else
        {
          fl_bg_color = p_cntx_SP->rprop.bg_color;
        }

        fl_bgfill_color_alpha = GM2_IMXRT_A(fl_bg_color); /* Alpha */
      
        if((p_cntx_SP->state.alpha < (UINT8)255) || (fl_bgfill_color_alpha < (UINT8)255))
        {
          fl_alpha_temp = ((UINT32)fl_bgfill_color_alpha*p_cntx_SP->state.alpha);
          fl_bgfill_color_alpha = (UINT8)(fl_alpha_temp/(UINT32)255);
                  
          pxp_as_buffer_config_t asBufferConfig;
          pxp_porter_duff_config_t pdConfig;
          
          pxp_as_pixel_format_t fl_as_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_pix_format(p_cntx_SP->rprop.fb_format); 
          /* Set AS to OUT */
          asBufferConfig.pixelFormat = fl_as_fb_format;
          asBufferConfig.bufferAddr  = (UINT32)outputConfig.buffer0Addr;
          asBufferConfig.pitchBytes  = outputConfig.pitchBytes;
          
          PXP_SetAlphaSurfacePosition(PXP_ID, 0, 0, fl_clip_w-1U, fl_clip_h-1U );
          PXP_SetAlphaSurfaceBufferConfig(PXP_ID, &asBufferConfig);
          PXP_EnableAlphaSurfaceOverlayColorKey(PXP_ID, 0);

          /* Disable PS, use as color generator */
          PXP_SetProcessSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U);
          PXP_SetProcessSurfaceBackGroundColor(PXP_ID, fl_bg_color);

          /* Configure DST OVER Porter-Duff blending */
          (void)memset(&pdConfig, 0, sizeof(pxp_porter_duff_config_t));
          pdConfig.enable             = 1;
          pdConfig.srcFactorMode      = kPXP_PorterDuffFactorInversed;
          pdConfig.dstFactorMode      = kPXP_PorterDuffFactorOne;
          pdConfig.dstColorMode       = kPXP_PorterDuffColorInversed;
          pdConfig.srcColorMode       = kPXP_PorterDuffColorStraight;
          pdConfig.dstGlobalAlphaMode = kPXP_PorterDuffGlobalAlpha;
          pdConfig.srcGlobalAlphaMode = kPXP_PorterDuffLocalAlpha;
          pdConfig.srcAlphaMode       = kPXP_PorterDuffAlphaStraight; 
          pdConfig.dstAlphaMode       = kPXP_PorterDuffAlphaStraight; 
          pdConfig.srcGlobalAlpha     = 0U;
          pdConfig.dstGlobalAlpha     = fl_bgfill_color_alpha;
          PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);		
            
          hmi_gfx_mgr02_imxrt_pxp_blt();
            
          pdConfig.enable             = 0;
          PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);

