RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
        }
        else
        {
          PXP_SetAlphaSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U); /* Disable AS. */
          PXP_SetProcessSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U); /* Disable PS. */
          PXP_SetProcessSurfaceBackGroundColor(PXP_ID, fl_bg_color);
          PXP_EnableOverWrittenAlpha(PXP_ID, true);
          PXP_SetOverwrittenAlphaValue(PXP_ID, fl_bgfill_color_alpha);
          hmi_gfx_mgr02_imxrt_pxp_blt();
          PXP_EnableOverWrittenAlpha(PXP_ID, false);
        }
      }

#ifdef GFX_STRING_CACHE_ENABLED
      /*
      1. Get the bmp pointer for the string from the cache.
        2. If it is not available then render that string and put it in the cache.
      */
      fl_str_img_data = hmi_gfx_mgr02_get_string_cache_ptr(fl_string_ptr, p_cntx_SP, fl_font_SP, fl_font_id, fl_fg_color);

      if(fl_str_img_data == NULL)
      {
        /* 
        1. Create a string.        
        */

        GFX_STRING_CACHE_INFO element;
        PixEngMemInfo fl_memory_s;
        UINT8 fl_font_height       = fl_font_SP->p.height;
        fl_glyph_draw_x            = (SINT16)0;
        fl_memory_s.MemCateg       = IMXRT_STRING_CACHE_BUFFER;
        fl_memory_s.WidgetClientId = 0xFFFFFFFFu; 
        fl_memory_s.Alignment      = (UINT32)32; /*32 Byte alignement*/
        fl_memory_s.Size           = (UINT32)(fl_full_text_width*fl_font_height*4);/* Considering ARGB8888 */
        fl_memory_s.ExtMemory      = (UINT8)1;
        #if defined(GFX_MGR02_MEM_MGMT_STATIC_ALLOCATION)    
        fl_memory_s.WidgetFBGroupId = GFX_MGR02_INVALID_FB_GROUP_ID;
        #endif
        fl_str_img_data            = hmi_gfx_mgr02_imxrt_mem_mgmt_malloc(&fl_memory_s);
        
        if(fl_str_img_data != NULL)
        {
          GFX_MGR02_CONTEXT_T fl_context_sp;
          (void)memset(fl_str_img_data,0,fl_memory_s.Size);
          hmi_gfx_mgr02_context_state_get(&fl_context_sp.state);
          fl_context_sp.rprop           = p_cntx_SP->rprop;
          fl_context_sp.rprop.fb_P      = (void *)fl_str_img_data;
          fl_context_sp.rprop.fb_w      = fl_full_text_width;
          fl_context_sp.rprop.fb_h      = fl_font_height;
          fl_context_sp.rprop.fb_format = kPXP_OutputPixelFormatARGB8888;
          fl_context_sp.state.loc.x     = 0;
          fl_context_sp.state.loc.y     = 0;
          fl_context_sp.state.alpha     = 255;
          
          draw_windows_bmp_string(fl_glyph_draw_x, &fl_context_sp, fl_string_ptr, fl_font_SP, fl_fg_color, fl_str_length);
          
          (void)HMI_STRNCPY(element.String, fl_string_ptr,(UINT32)GFX_MGR02_MAX_TEXT_LENGTH);
          element.String[GFX_MGR02_MAX_TEXT_LENGTH] = (HMI_CHAR)'\0';
          element.StringLen   = (UINT8)fl_str_length;
          element.FontId      = fl_font_id;
          element.FontSize    = fl_font_height;
          element.Buf         = fl_str_img_data;
          element.drawColor   = fl_fg_color;
          element.bmpWidth    = (UINT16)fl_full_text_width;

          hmi_gfx_mgr02_add_string_in_cache_queue(&element);
          
        }
      }
#endif

#ifndef GFX_STRING_CACHE_ENABLED
      fl_glyph_draw_x = (SINT16)fl_start_x;
      if (fl_use_ttf_engine == (UINT8)0)
      {
        draw_windows_bmp_string(fl_glyph_draw_x,p_cntx_SP,
        fl_string_ptr, fl_font_SP, fl_fg_color, fl_str_length);
      }
      else
      {
        /* To do for Monotype or Freetype Font engine */
      }
#else
      if(fl_str_img_data !=NULL)
      {         
        GFX_MGR02_IMAGE_DEF_T fl_element_def_SP;
        GFX_MGR02_CONTEXT_T fl_context_sp;

        GFX_MGR02_VISIBLE_AREA fl_new_clip;
        fl_new_clip.sx  = (SINT16)fl_start_x;
        fl_new_clip.sy  = p_cntx_SP->state.loc.y;
        fl_new_clip.ex  = fl_new_clip.sx + fl_full_text_width;
        fl_new_clip.ey  = fl_new_clip.sy + fl_font_SP->p.height;

        hmi_gfx_mgr02_context_state_get(&fl_context_sp.state);
        fl_context_sp.rprop           = p_cntx_SP->rprop;
        fl_context_sp.state.invisible = hmi_gfx_mgr02_context_validate_clip(&fl_context_sp.state.clip, &fl_new_clip);
        fl_context_sp.state.loc.x     = (SINT16)fl_start_x;

        fl_element_def_SP.format      = kPXP_AsPixelFormatARGB8888;
        fl_element_def_SP.compression = GFX_MGR02_IMAGE_COMPRESSION_NONE;
        fl_element_def_SP.chroma_key  = GFX_MGR02_IMAGE_CHROMA_KEY_NONE;
        fl_element_def_SP.vaoa_index  = 0;
        fl_element_def_SP.clut        = GFX_MGR02_NUM_OF_CLUTS;
        fl_element_def_SP.width       = fl_full_text_width;
        fl_element_def_SP.height      = fl_font_SP->p.height;
        fl_element_def_SP.color       =	0x0;
        fl_element_def_SP.pixel_data  = fl_str_img_data;
        hmi_gfx_mgr02_imxrt_pxp_build_image(&fl_context_sp, &fl_element_def_SP);
      }
#endif      
    }
  }
#ifdef GFX02_DEBUG_INFO
  else
  {
    gfx_debug("Imxrt Pxp - Text elem =%08X skipped\n", p_elem_def_SP);
  }
#endif
  fl_return_value = (s_gx_flocal)TRUE;
  GFX_MGR02_UNUSED_VAR(p_text_actual_width);
  return(fl_return_value);
}

/****************************************************************************
Function Name        : draw_windows_bmp_string
Description          : Build the outline font text.
Invocation           : Invoked by hmi_gfx_mgr02_imxrt_pxp_build_text()
Parameters           : SINT16 - X position
                       GFX_MGR02_CONTEXT_T  const * - Context
                       HMI_CHAR       const * String to render 
                       GFX_MGR02_FONT const * -Font info 
                       UINT8 * - Draw Colour
                       UINT32  - string Length
Return Value         :
Critical Section     : None
External Interfaces  : None
******************************************************************************/
static void draw_windows_bmp_string(SINT16 x, GFX_MGR02_CONTEXT_T const *p_cntx_SP,
                                    HMI_CHAR const * p_string_p, GFX_MGR02_FONT const * p_font_SP,
                                    UINT32 p_fg_color,	UINT32 p_str_length)
{
  HMI_CHAR const * fl_string_ptr = p_string_p;
  UINT32 fl_fg_color             = p_fg_color;
  SINT16 fl_glyph_draw_x         = x;
  SINT16 fl_glyph_draw_y         = p_cntx_SP->state.loc.y;
  UINT32 fl_alpha_temp;
  UINT8  fl_draw_color_alpha;
  SINT16 fl_glyph_width;
  SINT16 fl_glyph_height;
  SINT16 gpos_delta_x;
  UINT32 fl_bpp_size;
  SINT16 gpos_delta_y;
  pxp_ps_pixel_format_t fl_ps_fb_format;
  pxp_output_pixel_format_t fl_out_fb_format;
  
  GFX_MGR02_FONT_CHAR_CONFIG const * fl_font_fcc_SP;
  void * vImgAddr;
  void * fl_dest_ptr;
  UINT32 fl_str_length           = p_str_length;
  UINT16 fl_clip_w;
  UINT16 fl_clip_h;


