RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
#if defined(GFX_MGR02_FONT_GPOS_TABLE_ENABLED)
#if defined(GFX_MGR02_THAI_LANG_SUPPORT_NEEDED) || defined(GFX_MGR02_DEVANAGARI_LANG_SUPPORT_NEEDED)
  SINT16 fl_glyph_advance_x = 0;
#endif
#endif
  SINT32 fl_str_index       = (SINT32)0;
  UINT8 fl_buff_index       = 0U;
  GFX_FLOAT fl_resultantX   = 0.0F;
  GFX_FLOAT fl_resultantY   = 0.0F;
  
  fl_draw_color_alpha = GM2_IMXRT_A(fl_fg_color); /* Alpha */

  if((p_cntx_SP->state.alpha < (UINT8)255)||(fl_draw_color_alpha < (UINT8)255))
  {
    fl_alpha_temp       = ((UINT32)fl_draw_color_alpha*p_cntx_SP->state.alpha);
    fl_draw_color_alpha = (UINT8)(fl_alpha_temp/(UINT32)255);
  }
  else
  {
    fl_draw_color_alpha = p_cntx_SP->state.alpha;
  }

  while(fl_str_length > (UINT32)0)
  {
    fl_str_length--;
    fl_font_fcc_SP  = hmi_gfx_mgr02_get_fcc(fl_string_ptr[0], p_font_SP->f.lut_ptr, (UINT32)p_font_SP->size_table,
#if defined (GFX_MGR02_DEFAULT_FONT) && (GFX_MGR02_NUM_OF_FONT_GROUPS > 0)
      (UINT32)(p_cntx_SP->rprop.font_id),
#endif
      (UINT32)FALSE);
    if(fl_font_fcc_SP != GFX_MGR02_NULL_PTR)
    {
      fl_glyph_width  = (SINT16)fl_font_fcc_SP->width;
      fl_glyph_height = (SINT16)fl_font_fcc_SP->height;

      if (fl_font_fcc_SP->fdata != NULL)/*Valid font data*/
      {
        GFX_MGR02_GPOS_DELTA fl_delta_pixels = { 0.0f, 0.0f };
        vImgAddr = (void *)fl_font_fcc_SP->fdata;
        hmi_gfx_mgr02_imxrt_pxp_get_character_buf(vImgAddr, (UINT32 *)&l_char_argb_buf[fl_buff_index], fl_fg_color, fl_glyph_width, fl_glyph_height);
        vImgAddr = (void *)&l_char_argb_buf[fl_buff_index];
        if (fl_buff_index == 1U)
        {
            fl_buff_index = 0;
        }
        else
        {
            fl_buff_index = 1;
        }

#if defined(GFX_MGR02_FONT_GPOS_TABLE_ENABLED)
#if defined(GFX_MGR02_THAI_LANG_SUPPORT_NEEDED) || defined(GFX_MGR02_DEVANAGARI_LANG_SUPPORT_NEEDED)
        GFX_MGR02_GPOS_DELTA fl_gpos_info = {0.0f, 0.0f};
        BOOLEAN fl_gpos_found = FALSE;
#if defined(GFX_MGR02_THAI_LANG_SUPPORT_NEEDED) && defined(GFX_MGR02_DEVANAGARI_LANG_SUPPORT_NEEDED)
        if((GFX_MGR02_IS_THAI_JOIN_CHAR(fl_string_ptr[0]) == 1U) || (GFX_MGR02_DEVA_ZW_CHAR(fl_string_ptr[0]) == 1U))
#elif defined(GFX_MGR02_THAI_LANG_SUPPORT_NEEDED)
        if(GFX_MGR02_IS_THAI_JOIN_CHAR(fl_string_ptr[0]) == 1U)
#else
        if(GFX_MGR02_DEVA_ZW_CHAR(fl_string_ptr[0]) == 1U)
#endif
        {
          (void)hmi_gfx_mgr02_get_gpos_delta_pixels(&fl_delta_pixels, (fl_string_ptr-1) , fl_str_index, p_font_SP ,p_cntx_SP, GFX_MGR02_LANG_READ_DIR_LTR);
          /*X offset of the mark char should be positioned based on the previouse base char.
          For LTR languages, mark char will come after the base char. While rendering base char
          we are moving the x position based on owidth of the same. Hence the mark char
          position is adjusted based on previous base char position.
          Here fl_glyph_advance_x holds the owidth of the previous char*/
          fl_delta_pixels.gpos_delta_pixels_x -= (GFX_FLOAT)(fl_glyph_advance_x);
        }
        else
        {
          fl_glyph_advance_x = 0;
        }
        /*Store the owidth of the current char if is there any GPOS table found for the current and next char
        combination*/
        fl_gpos_found = hmi_gfx_mgr02_get_gpos_delta_pixels(&fl_gpos_info, &fl_string_ptr[0] ,fl_str_index ,p_font_SP, p_cntx_SP,  GFX_MGR02_LANG_READ_DIR_LTR);
#if defined(GFX_MGR02_THAI_LANG_SUPPORT_NEEDED) && defined(GFX_MGR02_DEVANAGARI_LANG_SUPPORT_NEEDED)
        if(((fl_gpos_found == TRUE) && (GFX_MGR02_IS_THAI_JOIN_CHAR(fl_string_ptr[1]) == 1U)) ||
          ((fl_gpos_found == TRUE) && (GFX_MGR02_DEVA_ZW_CHAR(fl_string_ptr[1]) == 1U)))
#elif defined(GFX_MGR02_THAI_LANG_SUPPORT_NEEDED)
        if((fl_gpos_found == TRUE) && (GFX_MGR02_IS_THAI_JOIN_CHAR(fl_string_ptr[1]) == 1U))
#else
        if((fl_gpos_found == TRUE) && (GFX_MGR02_DEVA_ZW_CHAR(fl_string_ptr[1]) == 1U))
#endif
        {
          fl_glyph_advance_x += (SINT16)fl_font_fcc_SP->owidth;
        }
#endif /* GFX_MGR02_THAI_LANG_SUPPORT_NEEDED */
#if defined(GFX_MGR02_ARABIC_LANG_SUPPORT_NEEDED)
        if(GFX_MGR02_IS_ARABIC_VOWEL(fl_string_ptr[0]) == 1U)
        {
          (void)hmi_gfx_mgr02_get_gpos_delta_pixels(&fl_delta_pixels, &fl_string_ptr[0], 0, p_font_SP ,p_cntx_SP, GFX_MGR02_LANG_READ_DIR_RTL);
        }
#endif /* GFX_MGR02_ARABIC_LANG_SUPPORT_NEEDED */
#if defined(GFX_MGR02_HEBREW_LANG_SUPPORT_NEEDED)
        if(GFX_MGR02_IS_HEBREW_VOWEL(fl_string_ptr[0]) == 1U)
        {
          (void)hmi_gfx_mgr02_get_gpos_delta_pixels(&fl_delta_pixels, &fl_string_ptr[0] , 0,p_font_SP ,p_cntx_SP, GFX_MGR02_LANG_READ_DIR_RTL);
        }                
#endif /* GFX_MGR02_HEBREW_LANG_SUPPORT_NEEDED */
#endif /* GFX_MGR02_FONT_GPOS_TABLE_ENABLED */
        {

          gpos_delta_x = (SINT16)(fl_delta_pixels.gpos_delta_pixels_x + 0.5f);
          gpos_delta_y = (SINT16)(fl_delta_pixels.gpos_delta_pixels_y + 0.5f);

          fl_resultantX = (GFX_FLOAT)((fl_font_fcc_SP->x_soffset) + gpos_delta_x) ;
          fl_resultantY = (GFX_FLOAT)((fl_font_fcc_SP->y_soffset) - gpos_delta_y);

#if !(defined(GFX_STRING_CACHE_ENABLED))

          GFX_MGR02_VISIBLE_AREA fl_curr_clip;
          GFX_MGR02_VISIBLE_AREA fl_new_clip;
          UINT8  fl_invisible;
          
          fl_curr_clip.sx = p_cntx_SP->state.clip.sx;
          fl_curr_clip.sy = p_cntx_SP->state.clip.sy;
          fl_curr_clip.ex = p_cntx_SP->state.clip.ex;
          fl_curr_clip.ey =	p_cntx_SP->state.clip.ey;
          fl_new_clip.sx  = fl_glyph_draw_x + fl_resultantX;
          fl_new_clip.sy  = p_cntx_SP->state.loc.y + fl_resultantY;
          fl_new_clip.ex  = fl_new_clip.sx + fl_glyph_width;
          fl_new_clip.ey  =	fl_new_clip.sy + fl_glyph_height;
          fl_invisible    = hmi_gfx_mgr02_context_validate_clip(&fl_curr_clip, &fl_new_clip);
          
          if((fl_invisible == 0U) && (fl_curr_clip.ex > fl_curr_clip.sx) && (fl_curr_clip.ey > fl_curr_clip.sy))
#else
          GFX_MGR02_VISIBLE_AREA fl_curr_clip;
          fl_curr_clip.sx = fl_glyph_draw_x + fl_resultantX;
          fl_curr_clip.sy = p_cntx_SP->state.loc.y + fl_resultantY;
          fl_curr_clip.ex = fl_curr_clip.sx + fl_glyph_width;
          fl_curr_clip.ey =	fl_curr_clip.sy + fl_glyph_height;
          
#endif
          {
            fl_clip_w = fl_curr_clip.ex - fl_curr_clip.sx;
            fl_clip_h = fl_curr_clip.ey - fl_curr_clip.sy;

#ifdef USE_IMXRT_PXP_QUEUE
            UINT32 fl_ps_fb_format  = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format(p_cntx_SP->rprop.fb_format);
            UINT32 fl_out_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
            UINT32 fl_as_bpp_size   = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(kPXP_AsPixelFormatARGB8888);
            UINT32 fl_ps_bpp_size   = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp(fl_ps_fb_format);	
            UINT32 fl_out_bpp_size  = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);	
            pxp_command_t * fl_pxp_comm_buff = hmi_gfx_mgr02_imxrt_pxp_get_active_pxp_buffer();
            fl_dest_ptr = (UINT32)p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * (UINT32)fl_glyph_draw_y * (fl_out_bpp_size/8)) + ((UINT32)fl_glyph_draw_x* (fl_out_bpp_size/8));

