RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
            //fl_pxp_comm_buff->CTRL       = PXP_CTRL_ROT_POS(0) | PXP_CTRL_ENABLE_MASK| PXP_CTRL_NEXT_IRQ_ENABLE_MASK|PXP_CTRL_IRQ_ENABLE_MASK |PXP_CTRL_BLOCK_SIZE(kPXP_BlockSize16);
            fl_pxp_comm_buff->CTRL       = PXP_CTRL_ROT_POS(0) | PXP_CTRL_ENABLE_MASK|PXP_CTRL_BLOCK_SIZE(kPXP_BlockSize16);
            fl_pxp_comm_buff->STAT       = 0x00000000;                              /* STAT, don't care */
            fl_pxp_comm_buff->OUT_CTRL   = PXP_OUT_CTRL_FORMAT(fl_out_fb_format)|PXP_OUT_CTRL_INTERLACED_OUTPUT(kPXP_OutputProgressive); /* OUT_CTRL */
            fl_pxp_comm_buff->OUT_BUF    = (UINT32)fl_dest_ptr;                     /* OUT_BUF */
            fl_pxp_comm_buff->OUT_BUF2   = 0x00000000;                              /* OUT_BUF2 */
            fl_pxp_comm_buff->OUT_PITCH  = p_cntx_SP->rprop.fb_w * (fl_out_bpp_size/8);                 /* OUT_PITCH */
            fl_pxp_comm_buff->OUT_LRC    = PXP_OUT_LRC_Y(fl_glyph_height -1) | PXP_OUT_LRC_X(fl_glyph_width -1); /* OUT_LRC */
            fl_pxp_comm_buff->OUT_PS_ULC = PXP_OUT_PS_ULC_Y(0) | PXP_OUT_PS_ULC_X(0);        /* OUT_PS_ULC */
            fl_pxp_comm_buff->OUT_PS_LRC = PXP_OUT_PS_LRC_Y(fl_glyph_height -1) | PXP_OUT_PS_LRC_X(fl_glyph_width -1);        /* OUT_PS_LRC */

            fl_pxp_comm_buff->OUT_AS_ULC    = PXP_OUT_AS_ULC_Y(0) | PXP_OUT_AS_ULC_X(0);                            /* OUT_AS_ULC */
            fl_pxp_comm_buff->OUT_AS_LRC    = PXP_OUT_AS_LRC_Y(fl_glyph_height -1) | PXP_OUT_AS_LRC_X(fl_glyph_width -1);                            /* OUT_AS_LRC */
            fl_pxp_comm_buff->PS_CTRL       = PXP_PS_CTRL_FORMAT(fl_ps_fb_format);   /* PS_CTRL */
            fl_pxp_comm_buff->PS_BUF        = (UINT32)fl_dest_ptr;                   /* PS_BUF */
            fl_pxp_comm_buff->PS_UBUF       = 0x00000000;                            /* PS_UBUF */
            fl_pxp_comm_buff->PS_VBUF       = 0x00000000;                            /* PS_VBUF */
            fl_pxp_comm_buff->PS_PITCH      = p_cntx_SP->rprop.fb_w * (fl_ps_bpp_size/8); /* PS_PITCH */
            fl_pxp_comm_buff->PS_BACHGROUND = 0x00000000;                            /* PS_BACHGROUND */
            fl_pxp_comm_buff->PS_SCALE      = 0x10001000;                            /* PS_SCALE */
            fl_pxp_comm_buff->PS_OFFSET     = 0x00000000;                            /* PS_OFFSET */
            fl_pxp_comm_buff->PS_CLRKEYLOW  = 0x00FFFFFF;                            /* PS_CLRKEYLOW */
            fl_pxp_comm_buff->PS_CLRKEYHIGH = 0x00000000;                            /* PS_CLRKEYHIGH */
            fl_pxp_comm_buff->AS_CTRL       = PXP_AS_CTRL_FORMAT(kPXP_AsPixelFormatARGB8888)|PXP_AS_CTRL_ROP(kPXP_RopMaskAs)|PXP_AS_CTRL_ALPHA(p_cntx_SP->state.alpha)|PXP_AS_CTRL_ALPHA_CTRL(kPXP_AlphaMultiply);                 /* AS_CTRL */
            fl_pxp_comm_buff->AS_BUF        = (UINT32)vImgAddr;                      /* AS_BUF */
            fl_pxp_comm_buff->AS_PITCH      = fl_glyph_width *(fl_as_bpp_size/8);    /* AS_PITCH */
            fl_pxp_comm_buff->AS_CLRKEYLOW  = 0x00FFFFFF;                            /* AS_CLRKEYLOW */
            fl_pxp_comm_buff->AS_CLRKEYHIGH = 0x00000000;                            /* AS_CLRKEYHIGH */


            fl_pxp_comm_buff->CSC1_COEF0    = 0x00000000;                            /* CSC1_COEF0, don't care. */
            fl_pxp_comm_buff->CSC1_COEF1    = 0x00000000;                            /* CSC1_COEF1, don't care. */
            fl_pxp_comm_buff->CSC1_COEF2    = 0x00000000;                            /* CSC1_COEF2, don't care. */
#if !(defined(FSL_FEATURE_PXP_HAS_NO_CSC2) && FSL_FEATURE_PXP_HAS_NO_CSC2)
            fl_pxp_comm_buff->CSC2_CTRL  = PXP_CSC2_CTRL_BYPASS_MASK; /* CSC2_CTRL */
            fl_pxp_comm_buff->CSC2_COEF0 = 0x00000000;                /* CSC2_COEF0, don't care. */
            fl_pxp_comm_buff->CSC2_COEF1 = 0x00000000;                /* CSC2_COEF1, don't care. */
            fl_pxp_comm_buff->CSC2_COEF2 = 0x00000000;                /* CSC2_COEF2, don't care. */
            fl_pxp_comm_buff->CSC2_COEF3 = 0x00000000;                /* CSC2_COEF3, don't care. */
            fl_pxp_comm_buff->CSC2_COEF4 = 0x00000000;                /* CSC2_COEF4, don't care. */
            fl_pxp_comm_buff->CSC2_COEF5 = 0x00000000;                /* CSC2_COEF5, don't care. */
#endif
#if !(defined(FSL_FEATURE_PXP_HAS_NO_LUT) && FSL_FEATURE_PXP_HAS_NO_LUT)
            fl_pxp_comm_buff->LUT_CTRL   = PXP_LUT_CTRL_BYPASS_MASK; /* LUT_CTRL */
            fl_pxp_comm_buff->LUT_ADDR   = 0x00000000;               /* LUT_ADDR */
            fl_pxp_comm_buff->LUT_DATA   = 0x00000000;               /* LUT_DATA */
            fl_pxp_comm_buff->LUT_EXTMEM = 0x00000000;               /* LUT_EXTMEM */
            fl_pxp_comm_buff->CFA        = 0x00000000;               /* CFA */
#endif
            fl_pxp_comm_buff->HIST_CTRL     = 0x00000020; /* HIST_CTRL */
            fl_pxp_comm_buff->HIST2_PARAM   = 0x00000F00; /* HIST2_PARAM */
            fl_pxp_comm_buff->HIST4_PARAM   = 0x0F0A0500; /* HIST4_PARAM */
            fl_pxp_comm_buff->HIST8_PARAM0  = 0x06040200; /* HIST8_PARAM0 */
            fl_pxp_comm_buff->HIST8_PARAM1  = 0x0F0D0B09; /* HIST8_PARAM1 */
            fl_pxp_comm_buff->HIST16_PARAM0 = 0x03020100; /* HIST16_PARAM0 */
            fl_pxp_comm_buff->HIST16_PARAM1 = 0x07060504; /* HIST16_PARAM1 */
            fl_pxp_comm_buff->HIST16_PARAM2 = 0x0B0A0908; /* HIST16_PARAM2 */
            fl_pxp_comm_buff->HIST16_PARAM3 = 0x0F0E0D0C; /* HIST16_PARAM3 */
            fl_pxp_comm_buff->POWER         = 0x00000000; /* POWER */
            fl_pxp_comm_buff->NEXT          = 0x00000000; /* NEXT, don't care */		  


            while (PXP_IsNextCommandPending(PXP_ID))
            {
            }
            PXP_ClearStatusFlags(PXP_ID, kPXP_CompleteFlag);
            //l_gfx_imxrt_pxp_blt_pending = 1;
            PXP_SetNextCommand(PXP_ID, fl_pxp_comm_buff);
            l_pxp_command_buffer_index++;
            if(l_pxp_command_buffer_index == MAX_NO_OF_PXP_COMMAND_BUFFER)
            {
              l_pxp_command_buffer_index = 0;
            }
#else	/* Without Queue blending */

            pxp_output_buffer_config_t outputBufferConfig;
            pxp_as_buffer_config_t asBufferConfig;
            pxp_porter_duff_config_t pdConfig;
            PXP_EnableCsc1(PXP_ID, false);     /* Disable CSC1, it is enabled by default. */
            PXP_SetProcessBlockSize(PXP, kPXP_BlockSize16); /* Block size 16x16 for higher performance */

            fl_ps_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_pix_format(p_cntx_SP->rprop.fb_format);
            fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp(fl_ps_fb_format);
            fl_dest_ptr = (void *)((UINT32)p_cntx_SP->rprop.fb_P + ((UINT32)p_cntx_SP->rprop.fb_w * (UINT32)fl_curr_clip.sy * (fl_bpp_size/8U)) + ((UINT32)fl_curr_clip.sx * (fl_bpp_size/8U)));
            pxp_ps_buffer_config_t psBufferConfig = {
              .pixelFormat = fl_ps_fb_format,
              .swapByte    = false,
              .bufferAddr  = (UINT32)fl_dest_ptr,
              .bufferAddrU = 0U,
              .bufferAddrV = 0U,
              .pitchBytes  = p_cntx_SP->rprop.fb_w * (fl_bpp_size/8U),
            };

