RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
            /* Alpha blending or color keying enabled - PS must be enabled to fetch background pixels
            PS and OUT buffers are the same, blend will be done in-place */

            PXP_SetProcessSurfaceBufferConfig(PXP_ID, &psBufferConfig);

            /* AS buffer - source image */
            asBufferConfig.pixelFormat = kPXP_AsPixelFormatARGB8888;

            fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(asBufferConfig.pixelFormat);
            asBufferConfig.bufferAddr  = (UINT32)vImgAddr + (fl_glyph_width * (fl_curr_clip.sy - fl_glyph_draw_y)*(fl_bpp_size/8U)) + ((fl_curr_clip.sx - fl_glyph_draw_x)*(fl_bpp_size/8U));
            //asBufferConfig.bufferAddr  =  (UINT32)vImgAddr + ((UINT32)p_elem_def_SP->width * (UINT32)fl_curr_clip.sy * (fl_bpp_size/8U)) + ((UINT32)(p_cntx_SP->state.clip.sx - p_cntx_SP->state.loc.x)* (fl_bpp_size/8U));
            asBufferConfig.pitchBytes  = fl_glyph_width *(fl_bpp_size/8U);
            
            PXP_SetAlphaSurfaceBufferConfig(PXP_ID, &asBufferConfig);
            PXP_EnableAlphaSurfaceOverlayColorKey(PXP_ID, 0);
            
            PXP_SetAlphaSurfacePosition(PXP_ID, 0, 0, (fl_clip_w -1U) ,(fl_clip_h -1U));
            PXP_SetProcessSurfacePosition(PXP_ID, 0, 0 , (fl_clip_w -1U), (fl_clip_h -1U));
            
            /* Output buffer. */
            fl_out_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
            fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_out_fb_format);
            outputBufferConfig.pixelFormat    = fl_out_fb_format;
            outputBufferConfig.interlacedMode = kPXP_OutputProgressive;
            outputBufferConfig.buffer0Addr    = (UINT32)fl_dest_ptr;
            outputBufferConfig.buffer1Addr    = (UINT32)0U;
            outputBufferConfig.pitchBytes     = p_cntx_SP->rprop.fb_w * (fl_bpp_size/8U);
            outputBufferConfig.width          = fl_clip_w;
            outputBufferConfig.height         = fl_clip_h;
            PXP_SetOutputBufferConfig(PXP_ID, &outputBufferConfig);			
                        
            /* Configure SRC OVER Porter-Duff blending */
            (void)memset(&pdConfig, 0, sizeof(pxp_porter_duff_config_t));
            pdConfig.enable             = 1;
            pdConfig.dstFactorMode      = kPXP_PorterDuffFactorInversed;
            pdConfig.srcFactorMode      = kPXP_PorterDuffFactorOne;
            pdConfig.srcColorMode       = kPXP_PorterDuffColorInversed;
            pdConfig.dstColorMode       = kPXP_PorterDuffColorStraight;
            pdConfig.srcGlobalAlphaMode = kPXP_PorterDuffScaledAlpha;
            pdConfig.dstGlobalAlphaMode = kPXP_PorterDuffLocalAlpha;
            pdConfig.dstAlphaMode       = kPXP_PorterDuffAlphaStraight; 
            pdConfig.srcAlphaMode       = kPXP_PorterDuffAlphaStraight; 
            pdConfig.dstGlobalAlpha     = 0U;
            pdConfig.srcGlobalAlpha     = fl_draw_color_alpha;
            PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);		
            
            hmi_gfx_mgr02_imxrt_pxp_blt();
            
            pdConfig.enable             = 0;
            PXP_SetPorterDuffConfig(PXP_ID, &pdConfig);
#endif /* USE_IMXRT_PXP_QUEUE */
          }
        }
      }
      fl_glyph_draw_x = fl_glyph_draw_x + (SINT16)fl_font_fcc_SP->owidth;
    }
    fl_string_ptr++;
    fl_str_index++;
  }
}
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_character_buf
Description          : This function will provide character buffer in ARGB8888
                       format after appending fg_color with alpha data of font.
Invocation           : 
Parameters           : p_char_alphadata,p_char_argb_data,p_fg_color,p_char_width,p_char_height
Return Value         : void
Critical Section     : None
External Interfaces  : None
******************************************************************************/
static void hmi_gfx_mgr02_imxrt_pxp_get_character_buf(UINT8 * p_char_alphadata,
                                                      UINT32 * p_char_argb_data,
                                                      UINT32 p_fg_color,
                                                      UINT32 p_char_width,
                                                      UINT32 p_char_height)
{
  UINT32 i;
  UINT32 fl_copy_bytes = p_char_height * p_char_width;
  UINT32 fl_char_alpha;
  UINT32 fl_fg_color;
  UINT32 fl_argb;
  UINT32 * fl_char_argb_data = p_char_argb_data;
  UINT8 * fl_char_alphadata = p_char_alphadata;
  for(i = 0; i < fl_copy_bytes; i++)
  {
    fl_char_alpha = *((UINT32 *)fl_char_alphadata) << 24;

    fl_fg_color = p_fg_color & 0x00ffffffU;
    fl_argb = (fl_char_alpha|fl_fg_color);

    *fl_char_argb_data = fl_argb;
    fl_char_argb_data++;
    fl_char_alphadata++;
  }
}

/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp
Description          : This function will provide output buffer bpp of imxrt
                       for the passed format
Invocation           : 
Parameters           : pxp_output_pixel_format_t
Return Value         : UINT32 bpp
Critical Section     : None
External Interfaces  : None
******************************************************************************/
UINT32 hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(pxp_output_pixel_format_t p_format)
{
  UINT32 fl_bpp;
  switch(p_format)
  {
  case kPXP_OutputPixelFormatARGB8888:
  case kPXP_OutputPixelFormatYUV1P444:
  case kPXP_OutputPixelFormatRGB888:
    {
      fl_bpp = (UINT32)32;
    }
    break;


  case kPXP_OutputPixelFormatRGB888P:
    {
      fl_bpp = (UINT32)24;
    }
    break;
  case kPXP_OutputPixelFormatARGB1555:
  case kPXP_OutputPixelFormatARGB4444:
  case kPXP_OutputPixelFormatRGB555:
  case kPXP_OutputPixelFormatRGB565:
  case kPXP_OutputPixelFormatUYVY1P422:
  case kPXP_OutputPixelFormatVYUY1P422:
  case kPXP_OutputPixelFormatYUV2P422:
  case kPXP_OutputPixelFormatYUV2P420:
  case kPXP_OutputPixelFormatYVU2P422:
  case kPXP_OutputPixelFormatYVU2P420:
    {
      fl_bpp = (UINT32)16;
    }
    break;
  case kPXP_OutputPixelFormatY8:
    {
      fl_bpp = (UINT32)8;
    }
    break;
  case kPXP_OutputPixelFormatY4:

    {
      fl_bpp = (UINT32)4;
    }
    break;
  default:
    {
      fl_bpp = (UINT32)32;
    }
    break;
  }
  return(fl_bpp);
}
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp
Description          : This function will provide bpp of imxrt
                       for the passed alpha buffer format
Invocation           :
Parameters           : pxp_as_pixel_format_t
Return Value         : UINT32 bpp
Critical Section     : None
External Interfaces  : None
******************************************************************************/
static UINT32 hmi_gfx_mgr02_imxrt_pxp_get_alpha_buf_bpp(pxp_as_pixel_format_t p_format)
{
  UINT32 fl_bpp;
  switch(p_format)
  {
  case kPXP_AsPixelFormatARGB8888:
  case kPXP_AsPixelFormatRGB888:
    {
      fl_bpp = (UINT32)32;
    }
    break;
  case kPXP_AsPixelFormatARGB1555:
  case kPXP_AsPixelFormatARGB4444:
  case kPXP_AsPixelFormatRGB555:
  case kPXP_AsPixelFormatRGB444:
  case kPXP_AsPixelFormatRGB565:
    {
      fl_bpp = (UINT32)16;
    }
    break;
  default:
    {
      fl_bpp = (UINT32)32;
    }
    break;
  }
  return(fl_bpp);
}
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp
Description          : This function will provide bpp of imxrt
                       for the passed process  buffer format
Invocation           :
Parameters           : pxp_ps_pixel_format_t
Return Value         : UINT32 bpp
Critical Section     : None
External Interfaces  : None
******************************************************************************/
static UINT32 hmi_gfx_mgr02_imxrt_pxp_get_process_buf_bpp(pxp_ps_pixel_format_t p_format)
{
    UINT32 fl_bpp;
    switch(p_format)
    {
        case kPXP_PsPixelFormatYUV1P444:
        {
            fl_bpp = (UINT32)32;
        }
        break;

        case kPXP_PsPixelFormatUYVY1P422:
        case kPXP_PsPixelFormatVYUY1P422:
        case kPXP_PsPixelFormatYUV2P422:
        case kPXP_PsPixelFormatYUV2P420:
        case kPXP_PsPixelFormatYVU2P422:
        case kPXP_PsPixelFormatYVU2P420:
        case kPXP_PsPixelFormatYVU422:
        case kPXP_PsPixelFormatYVU420:
        {
            fl_bpp = (UINT32)8;       /* Y channel bits */
        }
        break;
        case kPXP_PsPixelFormatRGB555:
        case kPXP_PsPixelFormatRGB444:
        case kPXP_PsPixelFormatRGB565:
        {
            fl_bpp = (UINT32)16;
        }
        break;
        case kPXP_PsPixelFormatY8:
        case kPXP_PsPixelFormatY4:
        default:
        {
            fl_bpp = (UINT32)32;
        }
        break;
    }
    return(fl_bpp);
}

/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_clear_buffer
Description          : Clears the framebuffer with passed color
Invocation           : Invoked internally
Parameters           : fill color
Return Value         : 
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_clear_buffer(GFX_MGR02_CONTEXT_T const * p_cntx_SP, UINT32 p_clear_color)
{
  s_gx_flocal fl_return_value=(s_gx_flocal)FALSE;
  UINT8 fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();
  UINT32 fl_fg_color = p_clear_color;
  UINT8  fl_fillcolor_alpha;

  if(GFX_MGR02_SHUTDOWN_EMERGENCY != fl_shutdown_state)
  {
    PXP_EnableCsc1(PXP_ID, false);                   /* Disable CSC1, it is enabled by default. */
    PXP_SetProcessBlockSize(PXP, kPXP_BlockSize16);  /* Block size 16x16 for higher performance */
    fl_fillcolor_alpha = GM2_IMXRT_A(fl_fg_color);
    pxp_output_pixel_format_t fl_fb_format = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_pix_format(p_cntx_SP->rprop.fb_format);
    UINT32 fl_bpp_size = hmi_gfx_mgr02_imxrt_pxp_get_output_buf_bpp(fl_fb_format);

