RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt_pxp.c
    pxp_output_buffer_config_t outputConfig = 
    {
        .pixelFormat    = fl_fb_format,
        .interlacedMode = kPXP_OutputProgressive,
        .buffer0Addr    = (UINT32)p_cntx_SP->rprop.fb_P,
        .buffer1Addr    = (UINT32)NULL,
        .pitchBytes     = p_cntx_SP->rprop.fb_w * (fl_bpp_size/8U),
        .width          = (UINT32)p_cntx_SP->rprop.fb_w,
        .height         = (UINT32)p_cntx_SP->rprop.fb_h,
    };	  
    PXP_SetOutputBufferConfig(PXP_ID, &outputConfig);
    PXP_SetAlphaSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U); /* Disable AS. */
    PXP_SetProcessSurfacePosition(PXP_ID, 0xFFFFU, 0xFFFFU, 0U, 0U); /* Disable PS. */
    PXP_SetProcessSurfaceBackGroundColor(PXP_ID, fl_fg_color);
    PXP_EnableOverWrittenAlpha(PXP_ID, true);
    PXP_SetOverwrittenAlphaValue(PXP_ID, fl_fillcolor_alpha);
    hmi_gfx_mgr02_imxrt_pxp_blt();
    PXP_EnableOverWrittenAlpha(PXP_ID, false);
  }
  fl_return_value = (s_gx_flocal)TRUE;
  return(fl_return_value);
}
/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_finish
Description          : This function to be called after all the blit commands of the widget are sent
to the command queue. 
Invocation           : hmi_gfx_mgr02_generic_build_dcu_gen_widget()
Parameters           : None
Return Value         : Non zero if any drawing operation performed, if no
drawing operations are performed returns FALSE
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_pxp_finish(void)
{


  UINT8 fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();

  if(GFX_MGR02_SHUTDOWN_EMERGENCY == fl_shutdown_state)
  {
      
    l_imxrt_draw_sts = (UINT8)0;  
  }
  #ifndef USE_IMXRT_PXP_QUEUE
  else
  {
    l_imxrt_draw_sts &= GFX_MGR02_IMXRT_NO_FLUSH_PENDING;  
      
  }
  #endif
  return((s_gx_flocal)l_imxrt_draw_sts);
}
#ifdef USE_IMXRT_PXP_QUEUE
/*============================================================================
** Function Name:    hmi_gfx_mgr02_imxrt_pxp_wait2complete_blit
** Visibility:       Global
** Description:
** Invocation:       By
** Inputs/Outputs:
** Critical Section: None.
** Created:
** Updated:
**==========================================================================*/
void hmi_gfx_mgr02_imxrt_pxp_wait2complete_blit(void)
{
  while (PXP_IsNextCommandPending(PXP_ID))
  {
  }
  if((l_imxrt_draw_sts & GFX_MGR02_IMXRT_FLUSH_PENDING) != 0)
  {
    /* Wait for process complete. */
    while (!(kPXP_CompleteFlag & PXP_GetStatusFlags(PXP_ID)))
    {
    }
    PXP_ClearStatusFlags(PXP_ID, kPXP_CompleteFlag);
    l_imxrt_draw_sts &= GFX_MGR02_IMXRT_NO_FLUSH_PENDING;
  }
}
#endif

#ifdef  __cplusplus
}
#endif

#endif /* #if (defined(GFX_MGR02_IMXRT) && (GFX_MGR02_NUM_AMBER_MERGE_WIDGETS>0))|| defined(GFX_MGR02_IMXRT_PXP) */

/*============================================================================
 **
 **============================================================================
 ** C M S    R E V I S I O N    N O T E S
 **============================================================================
 **
 ** For each change to this file, be sure to record:
 ** 1.  Who made the change and when the change was made.
 ** 2.  Why the change was made and the intended result.
 **
 ** CMS Rev #        Date         By
 ** CMS Rev X.X      mm/dd/yy     CDSID
 **
 **============================================================================
** CMS Rev 1.0      15-Jun-2021    CSAKTHIV
** Initial version.
**==========================================================================*/
/* end of file =============================================================*/

